/** 题库数据 — 由 tools/excel2js.py 自动生成 */
const SUBJECTS = {
  marx: {
    name: "马克思主义原理",
    questions: [
    {
        "question": "1844年8月底，马克思和恩格斯在巴黎会面。这次会面使他们发现彼此基本观点完全一致，于是开始了在科学理论研究和革命活动中的长期合作。马和恩格斯首次系统阐述历史唯物主义基本观点的著作是( )",
        "options": {
            "A": "《德意志意识形态)",
            "B": "《共产党宣言》",
            "C": "《哲学的贫困》",
            "D": "《神圣家族》"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 1
    },
    {
        "question": "马克思主义就其创立与发展而言，广义上说它是( )",
        "options": {
            "A": "关于无产阶级斗争的性质、目的和解放条件的学说",
            "B": "无产阶级争取自身解放和整个人类解放的学说体系",
            "C": "马克思和恩格斯创立的、并为后继者所不断发展的科学理论体系",
            "D": "马克思和恩格斯创立的基本理论、基本观点和基本方法构成的科学体系"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 2
    },
    {
        "question": "马克思、恩格斯始终站在革命斗争的前沿，他们的一生是为推翻旧世界建立新世界而不息战斗的一生。马克思、恩格斯领导创建的世界上第一个无产阶级政党是( ).",
        "options": {
            "A": "正义者同盟",
            "B": "共产主义者同盟",
            "C": "社会主义工人国际",
            "D": "国际工人协会"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 3
    },
    {
        "question": "马克思主义最根本的世界观和方法论是( )",
        "options": {
            "A": "劳动价值论和剩余价值学说",
            "B": "科学社会主义",
            "C": "唯物主义和辩证法",
            "D": "辩证唯物主义和历史唯物主义"
        },
        "answer": [
            "D"
        ],
        "type": "single",
        "source": "",
        "id": 4
    },
    {
        "question": "马克思主义是关于( )的科学。",
        "options": {
            "A": "无产阶级解放和全人类解放",
            "B": "哲学和社会科学",
            "C": "哲学和经济学",
            "D": "无产阶级和资产阶级"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 5
    },
    {
        "question": "恩格斯于1820年11月28日出生在德国巴门市的一个工厂主家庭。他称自已一生所做的事就是\"拉第二小提琴\"。恩格斯不仅与马克思一起创立马克思主义， 参与并指导国际工人运动，而且在传播和发展马克思主义方面作出了杰出的贡献恩格斯全面阐述马克思主义理论体系的著作是( )",
        "options": {
            "A": "《自然辩证法》",
            "B": "《反杜林论》",
            "C": "《共产党宣言》",
            "D": "《家庭、私有制和国家的起源》"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 6
    },
    {
        "question": "马克思和恩格斯之所以能够创立科学社会主义，主要是因为( )",
        "options": {
            "A": "德国是当时最为发达的资本主义国家",
            "B": "社会历史条件和个人努力的相互作用",
            "C": "他们对时代有着超乎常人的认知能力",
            "D": "他们拥有优良的家庭背景和教育经历"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 7
    },
    {
        "question": "习近平指出:\"中国共产党为什么能，中国特色社会主义为什么好，归根到底是因为马克思主义行!\"马克思主义之所以\"行\"，根本原因在于( )",
        "options": {
            "A": "马克思主义具有自觉的历史担当",
            "B": "马克思主义具有鲜明的政治立场",
            "C": "马克思主义是科学的世界观和方法论",
            "D": "马克思主义是无产阶级政党自我革命的武器"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 8
    },
    {
        "question": "马克思主义公开问世的标志是( )的公开发表。",
        "options": {
            "A": "《共产党宣言》",
            "B": "《神圣家族》",
            "C": "《资本论》",
            "D": "《德意志意识形态》"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 9
    },
    {
        "question": "空想社会主义理论之所以是空想的，根本原因在于( )",
        "options": {
            "A": "不成熟的资本主义生产状况和阶级状况",
            "B": "空想社会主义者的立场是资产阶级的",
            "C": "空想社会主义者知识不够渊博",
            "D": "空想社会主义构成复杂"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 10
    },
    {
        "question": "马克思主义具有鲜明的( )，这些特征体现了马克思主义的本质和使命，也展现出马克思主义的理论形象。",
        "options": {
            "A": "科学性",
            "B": "实践性",
            "C": "发展性",
            "D": "人民性"
        },
        "answer": [
            "A",
            "B",
            "C",
            "D"
        ],
        "type": "multiple",
        "source": "",
        "id": 11
    },
    {
        "question": "马克思主义是一个博大精深的理论体系，它的主体内容包括( )。",
        "options": {
            "A": "马克思主义人类学",
            "B": "科学社会主义",
            "C": "马克思主义哲学",
            "D": "马克思主义政治经济学"
        },
        "answer": [
            "B",
            "C",
            "D"
        ],
        "type": "multiple",
        "source": "",
        "id": 12
    },
    {
        "question": "马克思主义理论作为一个逻辑严密的有机整体，表现在它是( )。",
        "options": {
            "A": "以实践为检验标准",
            "B": "以事实为依据",
            "C": "以思维逻辑为论证方式",
            "D": "以规律为对象"
        },
        "answer": [
            "A",
            "B",
            "D"
        ],
        "type": "multiple",
        "source": "",
        "id": 13
    },
    {
        "question": "马克思的两个伟大发现是( )",
        "options": {
            "A": "资本主义社会发展规律",
            "B": "人类社会发展规律",
            "C": "共产党执政规律",
            "D": "社会主义发展规律"
        },
        "answer": [
            "A",
            "B"
        ],
        "type": "multiple",
        "source": "",
        "id": 14
    },
    {
        "question": "现代无产阶级额作为独立的政治力量登上历史舞台的标志性事件有( )。",
        "options": {
            "A": "英国宪章运动",
            "B": "法国里昂工人起义",
            "C": "德国西里西亚纺织工人起义",
            "D": "法国巴黎公社革命"
        },
        "answer": [
            "A",
            "B",
            "C"
        ],
        "type": "multiple",
        "source": "",
        "id": 15
    },
    {
        "question": "马克思主义的基本方法包括(",
        "options": {
            "A": "实事求是的方法",
            "B": "历史分析的方法",
            "C": "阶级分析的方法",
            "D": "辩证分析的方法"
        },
        "answer": [
            "A",
            "B",
            "C",
            "D"
        ],
        "type": "multiple",
        "source": "",
        "id": 16
    },
    {
        "question": "马克思主义的产生是多种因素共同作用的结果，这些因素包括( )a",
        "options": {
            "A": "资本主义社会的相当发展和基本矛盾的显现",
            "B": "马克思和恩格斯汲取了人类文明的优秀成果",
            "C": "马克思和恩格斯完成了世界观和阶级立场的转变",
            "D": "无产阶级作为独立的政治力量登上历史舞台"
        },
        "answer": [
            "A",
            "B",
            "C",
            "D"
        ],
        "type": "multiple",
        "source": "",
        "id": 17
    },
    {
        "question": "大学生在学习马克思主义理论的过程中，要有的正确态度和科学方法是( )。",
        "options": {
            "A": "努力学习和掌握马克思主义的基本立场、基本观点和基本方法",
            "B": "努力学习和掌握马克思主义中国化时代化的理论成果",
            "C": "自觉将马克思主义内化于心、外化于行",
            "D": "坚持理论联系实际的马克思主义学风"
        },
        "answer": [
            "A",
            "B",
            "C",
            "D"
        ],
        "type": "multiple",
        "source": "",
        "id": 18
    },
    {
        "question": "19世纪的先进思潮为马克思主义的创立提供了直接理论来源，其中最具有启发性的思潮有( )。",
        "options": {
            "A": "英法空想社会主义",
            "B": "德国历史学派",
            "C": "德国古典哲学",
            "D": "英国古典政治经济学"
        },
        "answer": [
            "A",
            "C",
            "D"
        ],
        "type": "multiple",
        "source": "",
        "id": 19
    },
    {
        "question": "新时代仍然要学习马克思，学习和实践马克思主义，因为马克思主义是 ( )。",
        "options": {
            "A": "解决世界金融危机的行动纲领",
            "B": "观察当代世界变化的认识工具",
            "C": "指引当代中国发展的行动指南",
            "D": "引领人类社会进步的科学真理"
        },
        "answer": [
            "B",
            "C",
            "D"
        ],
        "type": "multiple",
        "source": "",
        "id": 20
    },
    {
        "question": "原子论作为古代朴素唯物主义的代表，通过丰富的想象构建出原子这一世界的本原。这一理论虽然具有明显的缺陷，但仍然在西方思想史上产生了深刻的影响，也给予了马克思重要的思想启发，这表明人的意识( )",
        "options": {
            "A": "能够成为推动世界进步的物质力量",
            "B": "使世界分化为主观世界和客观世界",
            "C": "只能反映客观出已经存在的对象",
            "D": "会对物质世界产生能动积极的作用"
        },
        "answer": [
            "D"
        ],
        "type": "single",
        "source": "",
        "id": 21
    },
    {
        "question": "量子计算机在原理上可通过特定算法在一些具有重大社会和经济价值的问题方面，获得比经典计算机更强的算力。大规模量子计算机的物理实现是世界科技前沿的重大挑战之一。由中国科学团队开发的量子计算原型机\"九章二号\"实现了相位可编程功能，完成了对用于演示\"量子计算优越性\"的高斯玻色取样任务的快速求解。根据现已正式发表的最优经典算法理论，\"九章二号\"处理高斯玻色取样的速度比目前最快的超级计算机快1024倍。\"九章二号\"1毫秒可算出的问题，全球\"最快超算\"需30万亿年。量子计算机和经典计算机的关系表明( )",
        "options": {
            "A": "新事物的产生意味着旧事物的灭亡",
            "B": "新事物拥有旧事物所不能容纳的新内容",
            "C": "旧事物不能够随环境变化而进行改变",
            "D": "旧事物是不符合历史发展规律的事物"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 22
    },
    {
        "question": "历史是最好的教科书。我国自古以来就有从历史中总结经验、吸取教训的传统，并留下了诸如\"前事之不忘，后事之师也\"\"以古为镜，可以知兴替\"\"观今宜鉴古，无古不成今\"等发人深省的论断。在全面建设社会主义现代化国家的新征程上，我们更需要从历史中汲取智慧，以历史映照现实，从历史中展望未来。这是因为( )。",
        "options": {
            "A": "运用历史思维是把握历史主动的唯一条件",
            "B": "人类面临的问题都能从历史中找到现成答案",
            "C": "学习历史有助于认识人类社会发展的规律",
            "D": "人类的实践活动始终受到历史思维的影响"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 23
    },
    {
        "question": "(2016年考研政治真题)《百喻经》中有一则寓言:有一个愚人到别人家去做客，他嫌菜没有味道，主人就给他加了点盐。菜里加盐以后，味道好极了。愚人就想:\"菜之所以鲜美，是因为有了盐。加一点点就如此鲜美，如果加更多的盐岂不更加好吃?\"回家之后，他把一把盐放进嘴里，结果又苦又咸。这则寓言给我们的启示是( )。",
        "options": {
            "A": "在认识和处理问题时要掌握适度的原则",
            "B": "持续的量变会引起事物发生质的变化",
            "C": "在事物的发展过程中要时时注意事物的自我否定",
            "D": "不可能通过一些现象而去认识某个事物的本质"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 24
    },
    {
        "question": "近年来，无人驾驶技术取得了迅猛发展。尽管这一技术尚未成熟，一些潜在的风险也引发了人们的担忧、但相较于其他负面因素而言，无人驾驶技术所带来的积极效应更加显著，不仅能深刻影响人们的出行方式，也将带动一系列产业的高速发展。国家也积极出台相应政策，大力推动无人驾驶技术的研发与应用这表明( )",
        "options": {
            "A": "要看到矛盾的主要方面",
            "B": "要重视事物的量的积累",
            "C": "要抓住事物的主要矛盾",
            "D": "要积极推动事物的质变"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 25
    },
    {
        "question": "暗物质是人类在天文观测中推断可能存在的一种不可见的物质类型，其质量远大于宇宙中全部可见天体的总和。虽然人类在研究中已经发现了大量暗物质存在的证据，但对暗物质属性仍然了解很少。相较于各种已知的物质类型，暗物质可以说是一种未知的物质新类型。这表明( )",
        "options": {
            "A": "暗物质不能为人的意识所反映",
            "B": "暗物质不依赖于人的感觉而存在",
            "C": "暗物质不能被人的感觉而感知",
            "D": "暗物质不具有物质的共同转性"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 26
    },
    {
        "question": "习近平指出，激励人民群众自力更生、艰苦奋斗的内生动力，对人民群众创造自己的美好生活至关重要。坚持调动广大贫困群众积极性、主动性、创造性,激发脱贫内生动力，是中国能够战胜贫困的重要经验。这表明( )",
        "options": {
            "A": "意识在改造世界的活动中起决定性的作用",
            "B": "只要发挥主观能动性就能够改造客观世界",
            "C": "积极的精神力量可以有力地推动人的实践",
            "D": "尊重规律是人发挥主观能动性的根本途径"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 27
    },
    {
        "question": "(2022年考研政治真题)党的十八大以来，我国从中西部22个省份有劳动能力的建档立卡贫困人口中选聘了110.2万名生态护林员，走出了一条生态补偿脱贫的新路子，实现了生态保护和脱贫增收\"双赢\"，充分体现了\"人不负青山，青山定不负人\"的深刻哲理。\"人不负青山，青山定不负人\"表明( )。",
        "options": {
            "A": "人与自然是同一的，自然能够自发满足人的要求",
            "B": "生产力包括自然要素，合理开发自然能促进社会发展",
            "C": "人能动改造自然，自然能动补偿人的劳动",
            "D": "人是自然的一部分，人的发展只能适应自然的变化"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 28
    },
    {
        "question": "中国式现代化是中国共产党领导的社会主义现代化，党的领导激发了建设中国式现代化的强劲动力。改革开放以后，我们党以伟大历史主动精神不断变革生产关系和生产力之间、上层建筑和经济基础之间不相适应的方面，不断推进各领域体制改革，形成和发展符合当代中国国情、充满生机活力的体制机制。从对立统一规律的视角看，变革生产关系和生产力之间、上层建筑和经济基础之间不相适应的方面，意味着( )。",
        "options": {
            "A": "使生产力和生产关系的斗争性服从同一性",
            "B": "使上层建筑和经济基础互相转化为对方",
            "C": "使生产力和生产关系之间的矛盾得以消除",
            "D": "缓和了上层建筑和经济基础之间的冲突"
        },
        "answer": [
            "D"
        ],
        "type": "single",
        "source": "",
        "id": 29
    },
    {
        "question": "(2018年考研政治真题)\"马者所以命形也;白者所以命色也。命色者担命形也、故曰白马非马。\"从唯物辩证法的观点看,\"白马非马\"这一命题的错误在于( )",
        "options": {
            "A": "混淆了事物内容和形式之间的区别",
            "B": "割裂了事物共性和个性之间的联系",
            "C": "模糊了事物本质和现象之间的联系",
            "D": "颠倒了事物形态和功能之间的关系"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 30
    },
    {
        "question": "(2019年考研政治真题)虚拟现实技术是一种运用计算机仿真系统创建多源信息融合的交互式三维动态实景以及动作仿真的技术，可以给使用者提供沉浸性多感知性、交互性的互动体验。虚拟现实技术所构造的虚拟环境说明( )。",
        "options": {
            "A": "人们可以通过实践创造出自然界原本不存在的现实状态",
            "B": "信息是独立于物质和意识的第三种存在状态",
            "C": "物质世界不再具有客观实在性",
            "D": "物质世界的存在形式具有多样性"
        },
        "answer": [
            "A",
            "D"
        ],
        "type": "multiple",
        "source": "",
        "id": 31
    },
    {
        "question": "(2016年考研政治真题)显微摄影是一门使用照相机拍摄显微镜下一般用肉眼无法看清的标本的技术。肉眼中千篇一律的细沙，在显微镜下，却是\"一沙一世界\"。有的晶莹剔透像宝石，有的金黄酥脆像饼干。即使是司空见惯的柴米油盐，在显微镜下也会展现神奇而充满魅力的另一面。显微镜下的\"一沙一世界\"表明( )",
        "options": {
            "A": "人们可以通过制造和使用工具日益深化对客观世界的认识",
            "B": "事物的本质随着人们认识的变化而改变",
            "C": "任何事物都具有无限多样的属性",
            "D": "人们能够通过对个别事物的认识而达到对世界整体的把握"
        },
        "answer": [
            "A",
            "C",
            "D"
        ],
        "type": "multiple",
        "source": "",
        "id": 32
    },
    {
        "question": "(2014年考研政治真题)长江的年龄到底有多大?这里说的长江\"年龄\"是指从青藏高原奔流而下注入东海的\"贯通东流\"水系的形成年代。如果说上游沉积物从青藏高原、四川盆地顺延而下能到达下游，这就表明长江贯通了，这就物源示踪。我国科学家采用这一方法，研究长江中下游盆地沉积物的来源，从而判别长江上游的物质何时到达下游，间接指示了长江贯通东流的时限。他们经过10多年的研究，提出长江贯通东流的时间距今约2300万年。这一研究成果从一个侧面显示出( )",
        "options": {
            "A": "时间和空间是通过物质运动的变化表现出来的",
            "B": "时间和空间是物质运动的存在形式",
            "C": "时间和空间是标示物质运动的观念形式",
            "D": "时间和空间是有限的，物质运动是永恒的"
        },
        "answer": [
            "A",
            "B"
        ],
        "type": "multiple",
        "source": "",
        "id": 33
    },
    {
        "question": "问题是时代的声音，也是矛盾的集中体现，回答并指导解决问题是理论的根本任务。坚持问题导向是习近平新时代中国特色社会主义思想的重要方法。坚持问题导向，需要增强问题意识，善于发现问题，勇于正视问题，并不断提出真正解决问题的新理念新思路新办法。这启示我们，坚持问题导向( )",
        "options": {
            "A": "要承认矛盾的客观性",
            "B": "要找到消灭矛盾的途径",
            "C": "要注意把握矛盾的特殊性",
            "D": "要以认识矛盾作为出发点"
        },
        "answer": [
            "A",
            "C"
        ],
        "type": "multiple",
        "source": "",
        "id": 34
    },
    {
        "question": "在中国古典诗词中,\"月\"是一个蕴意十分丰富的意象。苏轼用\"人有悲欢离合，月有阴晴圆缺，此事古难全\"表达了对人世的感叹，王安石用\"春风又绿江南岸，明月何时照我还\"表达了对故乡的思念，张若虚用\"不知江月待何人，但见长江送流水\"表达了对时间的沉思。不同人物面对月亮表达出不同的情感与思索，这表明( )",
        "options": {
            "A": "意识能够有目的有计划地反映客观对象",
            "B": "意识能够创造性地对感性材料进行加工",
            "C": "意识的形式因不同个体差异而存在差别",
            "D": "意识来源于人脑对客观世界对象的反映"
        },
        "answer": [
            "A",
            "B",
            "C"
        ],
        "type": "multiple",
        "source": "",
        "id": 35
    },
    {
        "question": "全面推进乡村振兴，到2035年基本实现农业现代化，到本世纪中叶建成农业强国，是党中央着眼全面建成社会主义现代化强国作出的战略部署。强国必先强农，农强方能国强。农业强国是社会主义现代化强国的根基，满足人民美好生活需要、实现高质量发展、夯实国家安全基础，都离不开农业发展。其中体现的唯物辩证法原理有( )",
        "options": {
            "A": "矛盾贯穿于每一个事物发展过程的始终",
            "B": "矛盾的主要方面决定着事物的性质",
            "C": "主要矛盾和次要矛盾能够相互转化",
            "D": "主要矛盾在事物发展中起着决定性作用"
        },
        "answer": [
            "A",
            "D"
        ],
        "type": "multiple",
        "source": "",
        "id": 36
    },
    {
        "question": "我国脱贫攻坚战的全面胜利，标志着我们党在团结带领人民创造美好生活实现共同富裕的道路上迈出了坚实的一大步。同时我们也要清醒认识到，脱贫摘不是终点，而是新生活新奋斗的起点。在前进的道路上，我们没有任何理由骄傲自满、松劲歇脚，必须乘势而上、再接再厉、接续奋斗，这是因为( )",
        "options": {
            "A": "社会发展的总趋势是螺旋式上升的",
            "B": "社会发展是充满各种坎坷和曲折的",
            "C": "社会的发展是一个永无止境的过程",
            "D": "社会的发展呈现出周期性和阶段性"
        },
        "answer": [
            "A",
            "B",
            "C",
            "D"
        ],
        "type": "multiple",
        "source": "",
        "id": 37
    },
    {
        "question": "数据是国家基础性战略资源，没有数据安全就没有国家安全。近年来，随着我国不断推进网络强国、数字中国、智慧社会建设，以数据为新生产要素的数字经济蓬勃发展，数据的竞争已成为国际竞争的重要领域，数据安全的重要性也凸显出来，维护数据安全已成为事关国家安全与经济社会发展的重大问题。这启示我们要( )",
        "options": {
            "A": "坚持从动态发展的角度看待数据安全问题",
            "B": "把握数据安全和国家安全之间的相互联系",
            "C": "将维护数据安全作为维护国家安全的核心",
            "D": "从国家安全的总体全局考虑数据安全问题"
        },
        "answer": [
            "A",
            "B",
            "D"
        ],
        "type": "multiple",
        "source": "",
        "id": 38
    },
    {
        "question": "糖精(邻苯甲酰磺酰亚胺)是一种现代食品工业中常见的甜味剂，但它的发现却十分偶然。1879年的一天，俄国科学家康斯坦丁·法勒伯格在吃晚饭时无意中发现了自己手上有强烈的甜味，经过反复验证，法勒伯格终于确定甜味和当天他所进行的煤焦油衍生物实验有关。此后，法勒伯格又花费了数年时间，推动糖精实现了工业化量产。糖精的发现表明( )",
        "options": {
            "A": "科学上的发明创造是纯粹偶然因素的产物",
            "B": "偶然性在科学的发明创造中起决定性作用",
            "C": "科学发明背后的必然性因素支配着偶然性",
            "D": "科学发明中的必然性会通过偶然性表现出来"
        },
        "answer": [
            "C",
            "D"
        ],
        "type": "multiple",
        "source": "",
        "id": 39
    },
    {
        "question": "党的十八大以来，以习近平同志为核心的党中央把生态文明建设摆在全局工作的突出位置，推动我国生态环境保护发生历史性、转折性、全局性变化\"十四五\"时期，我国生态文明建设进入了实现生态环境改善由量变到质变的关销时期。这表明( )",
        "options": {
            "A": "事物发展的实质是事物自身进行自我否定",
            "B": "事物发展是前进性与曲折性相统一的过程",
            "C": "矛盾的主要方面对事物的发展起决定作用",
            "D": "任何事物的发展都有一个量的积累的过程"
        },
        "answer": [
            "B",
            "D"
        ],
        "type": "multiple",
        "source": "",
        "id": 40
    },
    {
        "question": "由大前提\"人都会死\"和小前提\"苏格拉底是人\"，认识到\"苏格拉底会死\"，这属于哪种认识反映形式( )。",
        "options": {
            "A": "感觉",
            "B": "表象",
            "C": "判断",
            "D": "推理"
        },
        "answer": [
            "D"
        ],
        "type": "single",
        "source": "",
        "id": 41
    },
    {
        "question": "恩格斯说:\"鹰比人看得远得多，但是人的眼睛识别东西远胜于鹰。狗比人具有锐敏得多的嗅觉，但是它连被人当做各种物的特定标志的不同气味的百分之一也辨别不出来。\"此处人的感官的识别能力之所以高于动物，是因为( )。",
        "options": {
            "A": "人有想象力",
            "B": "人的感官功能更强",
            "C": "人有非理性",
            "D": "人不仅有感觉还有思维"
        },
        "answer": [
            "D"
        ],
        "type": "single",
        "source": "",
        "id": 42
    },
    {
        "question": "《庄子•山木》中记载了这样一个故事:庄子行于山中，见大木枝叶盛茂，伐木者止其旁而不取也。问其故，曰:\"无所可用。\"庄子曰:\"此木以不材得终其天年。\"夫子出于山，舍于故人之家。故人喜，命竖子杀雁而烹之。竖子请曰:\"其一能鸣，其一不能鸣，请奚杀?\"主人曰:\"杀不能鸣者。\"明日，弟子问于庄子曰:\"昨日山中之木以不材，得终其天年;今主人之雁以不材死。先生将何处?\"庄子笑曰:\"周将处乎材与不材之间。材与不材之间，似之而非也。\"这个故事中关于\"材与不材\"的观点属于( )。",
        "options": {
            "A": "对主体需要的真理性认识",
            "B": "对客观事物属性及其满足主体需要的价值性评价",
            "C": "对主体需要的主观性评价",
            "D": "对客观事物发展规律的真理性认识"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 43
    },
    {
        "question": "(2017年考研政治真题)某地区进入供暖季后常常出现雾霾，而一旦出现大风天气或等到春暖花开后，雾霾就会散去或减少。从该地区较长时间的数据变化看，经过人们努力治霾，污染物排放总量在持续走低;但在某些时段，环境空气质量污染指数会迅速攀升，甚至\"爆表\"。这种看似\"矛盾\"的现象凸显了大气污染防治的一个特点:天帮忙很重要，但人努力才是根本。\"人努力\"与\"天帮忙\"之间的关系对我们正确处理主观能动性和客观规律性之间辩证关系的启示是( )。",
        "options": {
            "A": "尚未认识的外在自然规律对人的实践活动起着至关重要的作用",
            "B": "尊重事物的客观规律是正确发挥主观能动性的前提",
            "C": "人类有意识的思想活动是掌握客观规律的根本前提",
            "D": "认识活动是客观规律性与主观能动性相统一的基础"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 44
    },
    {
        "question": "\"纸上得来终觉浅、绝知此事要躬行\",与这句古诗在内涵上具有相同认识论原理的诗句是( )。",
        "options": {
            "A": "日出江花红胜火，春来江水绿如蓝",
            "B": "眼处心生句自神，暗中摸索总非真",
            "C": "床前明月光，疑是地上霜",
            "D": "近水楼台先得月，向阳花木易为春"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 45
    },
    {
        "question": "(2016年考研政治真题)《百喻经》中有一则寓言:有一个愚人到别人家去做客，他嫌菜没有味道，主人就给他加了点盐。菜里加了盐以后，味道好极了，愚人就想:\"菜之所以鲜美，是因为有了盐，加一点点就如此鲜美，如果加更多的盐岂不是更加好吃?\"回家以后，他把一把盐放进嘴里，结果又苦又咸，这则寓言给我们的启示是( )。",
        "options": {
            "A": "不可能通过一些现象而去认识某个事物的本质",
            "B": "在认识和处理问题时要掌握适度的原则",
            "C": "持续的量变会引起事物发生质的变化",
            "D": "在事物的发展过程中要时时注意事物的自我否定"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 46
    },
    {
        "question": "(2014年考研政治真题)爱迪生在发明电灯之前做了两千多次实验，有个年轻的记者曾经问他为什么遭遇这么多次失败。爱迪生回答:\"我一次都没有失败，我发明了电灯，这只是一段经历了两千步的历程。\"爱迪生之所以说\"我一次都没有失败\"，是因为他把每一次实验都看作( )。",
        "options": {
            "A": "事物发展过程中的次要矛盾",
            "B": "整个实践过程中的一部分",
            "C": "实践中可以忽略不计的偶然挫折",
            "D": "认识中获得的相对真理"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 47
    },
    {
        "question": "中国工程院院士袁隆平曾说:\"书本知识非常重要，电脑技术也很重要，但在书本电脑里面种不出水稻来，只有在田里才能种出水稻来。\"这表明( )。",
        "options": {
            "A": "理论对实践的指导不可靠",
            "B": "实践水平与认识水平不相关",
            "C": "认识是无限的",
            "D": "实践是人类认识的基础和来源"
        },
        "answer": [
            "D"
        ],
        "type": "single",
        "source": "",
        "id": 48
    },
    {
        "question": "(2020年考研政治真题)逐渐\"飞入寻常百姓家\"的人工智能对人类的社会生活产生了巨大影响。对此，技术乐观派认为人工智能为人类发展更新了\"发动机\"，悲观派则认为人工智能的发展可能导致\"人类的终结\"。对人工智能社会效用的评价是( )。",
        "options": {
            "A": "对客观事物的属性及其满足主体需要的价值性评价",
            "B": "受主体情感、兴趣和爱好影响的主观性评价",
            "C": "对主体需要发展程度的认知性评价",
            "D": "对客观事物发展规律的真理性评价"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 49
    },
    {
        "question": "地震预报可以让预测受灾区人们做好预防工作，进而减少人员伤亡和财产损失。根据时间尺度的不同，地震预报分为5个阶段，即:长期预报、中期预报、短期预报、临震预报和主震后余震预报。但是，由于各种因素限制，人类目前还无法直接观测地球内部变化，因此，地震预报对于世界各国地震学家而言依然是一道难题。这一事例说明( )。",
        "options": {
            "A": "认识的能动作用实现的条件性",
            "B": "世界是不可知的",
            "C": "认识总是滞后于实践",
            "D": "人的认识可以反映客观事物"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 50
    },
    {
        "question": "中国共产党在长期的革命实践中，确立了一条辩证唯物主义的思想路线，即一切从实际出发，理论联系实际，实事求是，在实践中检验真理和发展真理。以下关于中国共产党思想路线的说法正确的是( )。",
        "options": {
            "A": "中国共产党的思想路线是党坚持的世界观和方法论在实际工作中的运用和贯彻",
            "B": "党的思想路线是中国共产党对马克思主义理论发展作出的重大贡献，其核心是实事求是",
            "C": "认识路线是思想路线的哲学基础，党的思想路线是化为指导思想用以支配党的行动的认识路线，是认识论的具体体现",
            "D": "中国共产党的思想路线是党在实践活动中用以指导行动的基本原则和方法"
        },
        "answer": [
            "A",
            "B",
            "C",
            "D"
        ],
        "type": "multiple",
        "source": "",
        "id": 51
    },
    {
        "question": "在《关于费尔巴哈的提纲》中，马克思科学阐明了人类实践的本质和作用。创立了科学的实践观，之后，马克思、恩格斯的后继者们进一步不断丰富和发展了科学的实践观。以下属于科学实践观的意义的是( )。",
        "options": {
            "A": "揭示了实践对认识的决定作用，为能动的、革命的反映论的创立奠定了科学的理论基础",
            "B": "为人们能动地认识世界和改造世界提供了基本的思想方法和工作方法",
            "C": "克服了旧唯物主义的根本缺陷，为辩证唯物主义的创立奠定了科学的理论基础",
            "D": "在人类思想史上第一次揭示了社会生活的实践本质，为唯物史观的创立奠定了科学的理论基础"
        },
        "answer": [
            "A",
            "B",
            "C",
            "D"
        ],
        "type": "multiple",
        "source": "",
        "id": 52
    },
    {
        "question": "感性认识和理性认识是人对客观世界的两种不同水平的反映形式，狭义上讲，是认识过程的两个不同阶段。以下关于感性认识和理性认识的说法正确的是( )。",
        "options": {
            "A": "因为知觉是人的感觉器官对客观事物外部特征的整体的反映，知觉是感觉的综合，所以属于理性认识的知觉高于属于感性认识的感觉",
            "B": "\"这个冰激凌真甜\"，在这句话中\"冰激凌\"属于理性认识，\"甜\"属于感性认识",
            "C": "由于感性认识是对事物外部联系的认识，还没有深入到事物的内在联系，因而具有表面性和肤浅性，必须进一步上升到理性认识",
            "D": "推理是展开了的概念，是对事物之间的联系和关系的反映，是对事物是什么或不是什么、是否具有某种属性的判明和断定"
        },
        "answer": [
            "B",
            "C"
        ],
        "type": "multiple",
        "source": "",
        "id": 53
    },
    {
        "question": "人们在实践中，不仅坚持物的尺度即真理，而且坚持人的尺度即价值，以下关于价值尺度的叙述正确的是( )。",
        "options": {
            "A": "价值是反映主体和客体之间意义关系的哲学范畴，是客体对个人、群体乃至整个社会的生活和活动所具有的意义",
            "B": "价值体现的是主体和客体之间的一种特定关系，表现为人与满足其某种需要的客体之间的意义关系",
            "C": "价值观是人们关于价值本质的认识以及对人和事物的评价标准、评价原则和评价方法的观点的体系",
            "D": "价值离不开主体的需要，也离不开客体的特性"
        },
        "answer": [
            "A",
            "B",
            "C",
            "D"
        ],
        "type": "multiple",
        "source": "",
        "id": 54
    },
    {
        "question": "龙，是中国古代神话中的动物，为鳞虫之长，是中华民族的象征之一。相传龙能飞行，擅变化，会呼风唤雨等，与凤凰、麒麟等并列为祥瑞，古代主要寓意皇权。《尔雅翼》记载\"角似鹿、头似驼、眼似兔、项似蛇、腹似蜃、鳞似鱼、爪似鹰、掌似虎、耳似牛\"，《论衡》记载\"世俗画龙之象，马首蛇身\"。从人们对龙的记载中可以看出( )。",
        "options": {
            "A": "反映性是人类认识的基本规定性",
            "B": "人的认识无论表现形式多么抽象和复杂，归根到底都是对客观对象的反映",
            "C": "即便是人们虚构的事物、依然不可能是单纯地凭空捏造",
            "D": "认识是一种拼凑"
        },
        "answer": [
            "A",
            "B",
            "C"
        ],
        "type": "multiple",
        "source": "",
        "id": 55
    },
    {
        "question": "有这样一则寓言故事，一头驴子背盐渡河的时候在河边滑了一跤，它跌在水里后背上的盐融化了，当驴子站起来时，它感到身体轻松了许多，驴子非常高兴，它获得了经验。后来有一回，它背了棉花过河，它想起了曾经的经验，以为只要跌倒就可以同上次一样减轻背上的重量，于是它走到河边的时候，便故意跌在水中，令它没有想到的是，棉花吸收了水后变得更重了，驴子非但不能再站起来，而且一直往下沉，直到淹死。这个故事体现出( )。",
        "options": {
            "A": "真理和谬误没有确定的界限",
            "B": "经验绝对化并不可取",
            "C": "真理和谬误是认识过程中的两个阶段",
            "D": "任何真理都有自己适用的条件和范围"
        },
        "answer": [
            "B",
            "D"
        ],
        "type": "multiple",
        "source": "",
        "id": 56
    },
    {
        "question": "真理和价值是人类活动的两大尺度，真理是绝对性与相对性的统一。以下关于真理的绝对性说法正确的是( )。",
        "options": {
            "A": "真理在任何时候都是对客观事物的正确反映",
            "B": "任何真理都标志着主观与客观相符合，都包含着不依赖于人和人的意识的客观内容，都同谬误有原则的界限",
            "C": "人类认识按其本性来说，能够正确认识无限发展着的物质世界，认识每前进一步，都是对无限发展着的物质世界的接近",
            "D": "真理在一定条件下会转化为谬误"
        },
        "answer": [
            "B",
            "C"
        ],
        "type": "multiple",
        "source": "",
        "id": 57
    },
    {
        "question": "在西方哲学史上，康德把实践看作理性先天的道德活动，黑格尔把实践理解为主体自我实现的精神活动，费尔巴哈所理解的实践仅限于日常生活活动，并将实践等同于生物适应环境的活动。与前述理解不同，马克思和恩格斯将实践理解为人类能动地改造世界的社会性的物质活动，强调其具有客观实在性、自觉能动性和社会历史性三个基本特征。实践的客观实在性表现在( )。",
        "options": {
            "A": "实践的水平、广度、深度和发展过程，都受着客观条件的制约和客观规律的支配",
            "B": "与动物本能的、被动的适应性活动不同，人的实践活动是一种有目的、有意识的活动",
            "C": "构成实践活动的诸要素，即实践的主体、客体和中介，都是可感知的客观实在",
            "D": "实践能够引起客观世界的某种变化，可以把人脑中观念的存在变为现实的存在，给人们提供现实的成果"
        },
        "answer": [
            "A",
            "C",
            "D"
        ],
        "type": "multiple",
        "source": "",
        "id": 58
    },
    {
        "question": "随心所欲是指人完全按照自己的意愿去行事，想怎么做就怎么做。实践表明，如果在现实生活中，人一味按照自己的意愿想怎么做就怎么做，一定会四处碰壁。与随心所欲的自由观不同，马克思主义自由观认为( )。",
        "options": {
            "A": "人应该顺应自然，抹杀自由的可能性",
            "B": "自由的实现不仅需要对客观事物及其运动发展规律的正确认识，而且需要将获得的规律性认识运用于指导实践，实现改造世界的目的",
            "C": "自由是人在活动中通过认识和利用必然所表现出的一种自觉自主的状态",
            "D": "客观自由并不存在，只有人的意志或某种精神力量的绝对自由"
        },
        "answer": [
            "B",
            "C"
        ],
        "type": "multiple",
        "source": "",
        "id": 59
    },
    {
        "question": "唯心主义认识论认为认识不依赖于外部事物，人的认识都是先于感觉经验或者是超越于经验范围之外的，认为物质世界是思想和精神的产物。以下属于唯心主义认识论的说法是( )。",
        "options": {
            "A": "不是风动，不是幡动，仁者心动",
            "B": "实践是认识的基础",
            "C": "我思故我在",
            "D": "存在就是被感知"
        },
        "answer": [
            "A",
            "C",
            "D"
        ],
        "type": "multiple",
        "source": "",
        "id": 60
    },
    {
        "question": "(2019年考研政治真题)马克思指出，判断一个变革时代不能以该时代的意识为依据，相反，这个意识必须从物质生活的矛盾中去解释。这里的物质生活的矛盾从根本上说是( )。",
        "options": {
            "A": "经济基础与上层建筑的现存冲突",
            "B": "人类社会与自然界的现存冲突",
            "C": "社会存在与社会意识的现存冲突",
            "D": "社会生产力与生产关系的现存冲突"
        },
        "answer": [
            "D"
        ],
        "type": "single",
        "source": "",
        "id": 61
    },
    {
        "question": "(2015年考研政治真题)社会存在决定社会意识，社会意识是社会存在的反映。社会意识具有相对独立性，即它在反映社会存在的同时，还有自己特有的发展形式和规律。社会意识的相对独立性最突出的表现是( )。",
        "options": {
            "A": "社会意识各种形式各自具有其历史继承性",
            "B": "社会意识内部各种形式之间的相互作用和影响",
            "C": "社会意识与社会存在发展的不完全同步性",
            "D": "社会意识对社会存在具有能动的反作用"
        },
        "answer": [
            "D"
        ],
        "type": "single",
        "source": "",
        "id": 62
    },
    {
        "question": "(2023年考研政治真题)社会形态是关于社会运动的具体形式、发展阶段和不同质态的范畴，是同生产力发展一定阶段相适应的经济基础与上层建筑的统一体。人类社会历史划分为原始社会、奴隶社会、封建社会、资本主义社会和共产主义社会(社会主义社会是其第一阶段)五种社会形态，其依据是( )。",
        "options": {
            "A": "经济基础特别是生产关系的性质",
            "B": "人们的社会交往和分工的范围和水平",
            "C": "统治集团的阶级和政治属性",
            "D": "生产工具的质量和数量"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 63
    },
    {
        "question": "(2023年考研政治真题)习近平总书记在为《复兴文库》所写的序言中指出:\"修史立典，存史启智，以文化人，这是中华民族延续几千年的一个传统。\"\"编纂出版《复兴文库》大型历史文献丛书，就是要通过对近代以来重要思想文献的选编，述录先人的开拓，启迪来者的奋斗。\"\"历史是最好的教科书，一切向前走，都不能忘记走过的路;走得再远、走到再光辉的未来，也不能忘记走过的过去。\"这表明( )。",
        "options": {
            "A": "一切历史都是当代史",
            "B": "历史过程不包含任何偶然的因素",
            "C": "历史事件往往可以完整重复和再现",
            "D": "历史、现实、未来是相通的"
        },
        "answer": [
            "D"
        ],
        "type": "single",
        "source": "",
        "id": 64
    },
    {
        "question": "(2024年考研政治真题)习近平总书记指出:\"实践发展永无止境，解放思想永无止境，改革开放也永无止境，改革开放只有进行时、没有完成时。\"新时代坚持和发展中国特色社会主义，根本动力仍然是全面深化改革开放。改革开放的鲜明特征和首要任务是( )。",
        "options": {
            "A": "促进社会公平正义、增进人民福祉",
            "B": "形成更加成熟更加定型的制度",
            "C": "解放和发展社会生产力",
            "D": "处理好政府和市场的关系"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 65
    },
    {
        "question": "(2014年考研政治真题)俄国早期马克思主义理论家普列汉诺夫说，决不会有人去组织一个\"月食党\"以促进或阻止月食的到来，但要进行革命就必须组织革命党。这是因为社会规律与自然规律有所不同，它是( )。",
        "options": {
            "A": "不具有重复性的客观规律",
            "B": "比自然规律更易于认识的规律",
            "C": "通过人的有意识的活动实现的",
            "D": "由多数人的意志决定的"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 66
    },
    {
        "question": "(2021年考研政治真题)习近平强调，\"历史是最好的教科书\"，\"历史的经验值得注意，历史的教训更应引以为戒\"，\"中国革命历史是最好的营养剂\"。人们能够从历史中汲取经验教训，是因为( )。",
        "options": {
            "A": "人类历史发展存在着不以人的意志为转移的规律",
            "B": "历史规律和自然规律存在着惊人的相似性",
            "C": "历史总是在循环往复中不断向前发展",
            "D": "人类已经完全掌握了历史发展的内在规律"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 67
    },
    {
        "question": "法律作为上层建筑的重要组成部分，不是凭空产生的，也不是永恒存在的，是由一定的社会物质生活条件所决定的。决定法律本质、内容和发展方向的根本因素是( )。",
        "options": {
            "A": "人口素质",
            "B": "生活惯例",
            "C": "地理环境",
            "D": "物质资料的生产方式"
        },
        "answer": [
            "D"
        ],
        "type": "single",
        "source": "",
        "id": 68
    },
    {
        "question": "(2021年考研政治真题)智能生物识别等人工智能新技术快速走进老百姓的生活。然而，在新技术快速发展应用的同时，也因法律法规相对滞后而引发人们对信息安全和隐私保护的担忧。有专家呼吁，在发展新技术时，要划定法律禁区、制定行业规范，构建一个新技术健康发展的法律法规体系。从社会意识和社会存在的关系看，法律法规( )。",
        "options": {
            "A": "与新技术发展具有不平衡性",
            "B": "总是阻碍新技术的健康发展",
            "C": "只能落后于新技术发展",
            "D": "归根到底是新技术发展的内在动力"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 69
    },
    {
        "question": "(2018年考研政治真题)坚持以人民为中心，就必须坚持人民主体地位，坚持立党为公、执政为民，践行全心全意为人民服务的根本宗旨，把党的群众路线贯彻到治国理政全部活动之中，把人民对美好生活的向往作为奋斗目标。\"坚持以人民为中心\"的理论基础是唯物史观关于( )。",
        "options": {
            "A": "人民群众是历史的创造者的原理",
            "B": "人的本质是一切社会关系的总和的原理",
            "C": "人民群众的活动受到社会历史条件制约的原理",
            "D": "总体的人在总体的历史过程中的主体地位的原理"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 70
    },
    {
        "question": "(2020年考研政治真题)2019年10月24日，中共中央政治局就区块链技术发展现状和趋势进行集体学习。习近平在主持学习时指出，我们要\"提高运用和管理区块链技术能力、使区块链技术在建设网络强国、发展数字经济、助力经济社会发展等方面发挥更大作用\"。有专家认为，基于区块链技术，人们可以构建在没有中介辅助下多个参与方之间的资产交易、价值传递的网络，通过建立执行智能合约、推动契约关系和规则的维护和履行，降低信用建立成本，营造良好市场环境。区块链技术所实现的人与人之间相互联系的延伸和交化，表明人们的现实社会关系( )。",
        "options": {
            "A": "具有多样性和复杂性的特征",
            "B": "是由信息技术构造的虚拟关系",
            "C": "归根到底受生产关系的制约",
            "D": "是一种单纯的经济和商业关系"
        },
        "answer": [
            "A",
            "C"
        ],
        "type": "multiple",
        "source": "",
        "id": 71
    },
    {
        "question": "恩格斯曾指出:\"如果说，在中世纪的黑夜之后，科学以意想不到的力量一下子重新兴起，并以神奇的速度发展起来，那么，我们要再次把这个奇迹归功于生产。\"马克思认为\"生产力中也包括科学\"，这说明( )。",
        "options": {
            "A": "科学是一般的生产力",
            "B": "科学不是生产力的独立的、直接的要素",
            "C": "从一定意义上说，生产的需要决定了科学的产生和发展",
            "D": "科学越来越不具有独立性"
        },
        "answer": [
            "A",
            "B",
            "C"
        ],
        "type": "multiple",
        "source": "",
        "id": 72
    },
    {
        "question": "(2015年考研政治真题)马克思主义从必然性与偶然性的辩证统一中理解杰出人物的历史作用。认为( ).",
        "options": {
            "A": "杰出人物历史作用的形成和发挥与其顺应人民群众的意愿密不可分",
            "B": "杰出人物会因其智慧、性格因素对社会进程发生影响",
            "C": "杰出人物的历史作用受到一定历史条件的制约",
            "D": "杰出人物能够改变历史发展的基本方向"
        },
        "answer": [
            "A",
            "B",
            "C"
        ],
        "type": "multiple",
        "source": "",
        "id": 73
    },
    {
        "question": "(2014年考研政治真题)作家史铁生在《奶奶的星星》中讲道，奶奶告诉他的故事与通常的说法不同:一般人说，地上死一个人，天上就熄灭了一颗星星;而奶奶说，地上死一个人，天上又多了一个星星，人死了就升到天空，变成星星给走夜道的人照个亮了。于是他\"慢慢相信，每一个活过的人，都能给人的路途上添些光亮，也许是一颗巨星，也许是一把火炬，也许只是一支含泪的烛光......\"这对我们理解个人在社会历史中的作用的启示有( )。",
        "options": {
            "A": "人人都是历史的创造者",
            "B": "历史是无数个人相互作用的合力的结果",
            "C": "每个人对社会发展都有或大或小的作用",
            "D": "杰出个人决定历史发展的走向"
        },
        "answer": [
            "B",
            "C"
        ],
        "type": "multiple",
        "source": "",
        "id": 74
    },
    {
        "question": "(2018年考研政治真题)社会形态的更替具有客观性和必然性，但这并不否定人们历史活动的能动性，并不排斥人们在遵循社会发展规律的基础上，对于某种社会形态的历史选择性。人们历史活动的能动性和选择性主要体现在( )。",
        "options": {
            "A": "社会发展的客观过程由每一个参与历史活动的个人的主观意志所决定",
            "B": "社会发展的客观必然性为人们的历史选择提供了基础、范围和可能性空间",
            "C": "社会形态更替的过程是主体能动性与客观规律性相统一的过程",
            "D": "人们的历史选择性归根结底是人民群众的选择性"
        },
        "answer": [
            "B",
            "C",
            "D"
        ],
        "type": "multiple",
        "source": "",
        "id": 75
    },
    {
        "question": "(2022年考研政治真题)如今,\"逆袭\"\"超燃\"\"躺平\"\"凡尔赛\"\"YYDS\"等网络热词令人应接不暇，了解这些网络语的意思用法，几乎成了网上冲浪的必修课。嵌入日常生活交流的网络热词，为语言的发展带来新语料，也能够让人们一窥当下的社会生活和社会心态。网络热词流行的现象表明( )。",
        "options": {
            "A": "社会心态是社会生产和生活的反映",
            "B": "社会意识随着社会存在的发展而变化",
            "C": "社会心态的差异性决定社会生活的多样性",
            "D": "社会意识是主体对社会生活的自发反映"
        },
        "answer": [
            "A",
            "B"
        ],
        "type": "multiple",
        "source": "",
        "id": 76
    },
    {
        "question": "(2020年考研政治真题)一方水土孕育一方文化。很早以前，人们就在平原、高原、山地、河谷、海域等广阔的地域空间发展出农耕、渔猎、游牧等不同经济形态，进而形成具有明显地域差别的文化。高铁、互联网等虽然极大地消除了不同地域空间之间的界限，加速地域文化的同质性转化，但地域文化并没有消失，还在持续对当代社会发展产生重要影响。\"一方水土孕育一方文化\"表明( )。",
        "options": {
            "A": "社会经济状况决定文化发展形态",
            "B": "自然地理空间影响文化的外在特征",
            "C": "文化是人类社会发展的决定力量",
            "D": "不同形态文化的发展具有相对独立性"
        },
        "answer": [
            "A",
            "B",
            "D"
        ],
        "type": "multiple",
        "source": "",
        "id": 77
    },
    {
        "question": "(2021年考研政治真题)人的身体是抗击病毒的\"机器\"。当病原体进入人体，人会发烧，升高的体温刺激免疫系统打败病毒。在理想的情况下，热量创造了一个环境，让病原体难以生存。科学家研究发现，随着自然界的温度不断升高，病原体生存的环境也在整体升温，在这种情况下，它们更加能够适应人体发烧的体温。一旦病原体适应更高的温度，人的免疫系统就无法发挥作用。人的免疫系统与自然环境之间的关系表明( )。",
        "options": {
            "A": "人类在受自然环境制约的同时也改变自然环境",
            "B": "人类只能适应自然环境变化而不能改变自然环境",
            "C": "自然环境对人类发展具有决定性作用",
            "D": "自然环境是人类生存和发展的重要前提"
        },
        "answer": [
            "A",
            "D"
        ],
        "type": "multiple",
        "source": "",
        "id": 78
    },
    {
        "question": "(2017年考研政治真题)唯物史观在坚持人民群众是历史的创造者这一基本前提下，高度重视个人在历史上的作用。历史人物是一定历史事件的主要倡导者、组织领导者或思想理论、科学文化的重要代表人物。下列关于历史人物历史作用的正确认识是( )。",
        "options": {
            "A": "历史人物不论发挥什么样的作用都不能决定和改变历史发展的总进程和总方向",
            "B": "历史人物会因其智慧、性格等因素对社会进程发生影响",
            "C": "具有进步意义的历史人物往往能够首先发现或提出历史进程中新的历史任务",
            "D": "历史人物对历史发展的作用都是积极的"
        },
        "answer": [
            "A",
            "B",
            "C"
        ],
        "type": "multiple",
        "source": "",
        "id": 79
    },
    {
        "question": "(2023年考研政治真题)马克思、恩格斯在领导无产阶级斗争的实践中，始终强调领袖权威的必要性和重要性。马克思说过:\"一个单独的提琴手是自己指挥自己，一个乐队就需要一个乐队指挥。\"恩格斯也指出，\"没有权威，就不可能有任何的一致行动\"，并以大海航行的例子说明权威的重要性。在总结巴黎公社失败的经验教训时，马克思深刻指出，革命胜利后组织新政权、维护新政权、建立新政权都需要权威。恩格斯则明确指出，\"巴黎公社遭到灭亡，就是由于缺乏集中和权威。\"这表明，无产阶级领袖在历史上能够( )。",
        "options": {
            "A": "引领社会发展的方向",
            "B": "影响历史事件的进程",
            "C": "凝聚人民群众的力量",
            "D": "创造人类社会的历史"
        },
        "answer": [
            "A",
            "B",
            "C"
        ],
        "type": "multiple",
        "source": "",
        "id": 80
    },
    {
        "question": "(2016年考研政治真题)某资本家投资100万元创办企业从事生产，60万元用于固定资本、以购买机器设备等，40万元用于流动资本、以购买原材料和劳动力等(其中购买劳动力支付了10万元)。一轮生产结束后，该企业的总资本达到了120万元。那么该企业的剩余价值率为( )。",
        "options": {
            "A": "20%",
            "B": "100%",
            "C": "200%",
            "D": "50%"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 81
    },
    {
        "question": "(2023年考研政治真题)马克思在《资本论》中指出:\"不管生产力发生了什么变化，同一劳动在同样的时间内提供的价值量总是相同的。但它在同样的时间内提供的使用价值量是不同的:生产力提高时就多些，生产力降低时就少些。\"这段话表明，生产力的变化( )。",
        "options": {
            "A": "影响同一劳动在同样的时间内生产的单个商品价值量",
            "B": "不影响同一劳动在同样的时间内生产的商品数量",
            "C": "不改变同一劳动在同样的时间内的生产效率",
            "D": "改变同一劳动在同样的时间内提供的价值总量"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 82
    },
    {
        "question": "(2017年考研政治真题)某企业投资汽车生产，生产一辆汽车所耗费的生产资料价值为15万元，支付给工人的工资为5万元，假定市场的平均利润率为10%，那么，在自由竞争条件下，该汽车的生产价格是( )。",
        "options": {
            "A": "20万元",
            "B": "20.5万元",
            "C": "21.5万元",
            "D": "22万元"
        },
        "answer": [
            "D"
        ],
        "type": "single",
        "source": "",
        "id": 83
    },
    {
        "question": "(2019年考研政治真题)在以私有制为基础的商品经济中，商品生产者的私人劳动生产的产品是否与社会的需求相适应，作为具体劳动的有用性质能否为社会所承认，商品的使用价值和价值之间的矛盾能否得到解决，决定着商品生产者的命运。以私有制为基础的商品经济的基本矛盾是( )。",
        "options": {
            "A": "私人劳动和社会劳动的矛盾",
            "B": "具体劳动和抽象劳动的矛盾",
            "C": "脑力劳动和体力劳动的矛盾",
            "D": "使用价值和价值之间的矛盾"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 84
    },
    {
        "question": "(2022年考研政治真题)马克思在《资本论》中指出:\"一个商品占有者出售他现有的商品，而另一个商品占有者却只是作为货币的代表或作为未来货币的代表来购买这种商品。卖者成为债权人，买者成为债务人。由于商品的形态变化或商品的价值形式的发展在这里起了变化，货币也就取得了另一种职能。\"这里所论述的货币\"另一种职能\"指的是( )。",
        "options": {
            "A": "储藏手段",
            "B": "价值尺度",
            "C": "支付手段",
            "D": "流通手段"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 85
    },
    {
        "question": "(2018年考研政治真题)《资本论》(德文版)第一卷于1867年9月在汉堡出版，其影响力历经150多年风雨而不衰，至今对我们分析、理解现实经济问题依然具有很强的指导意义。马克思主义政治经济学的理论十分丰富，其中\"理解政治经济学的枢纽\"的理论是( )。",
        "options": {
            "A": "价值规律理论",
            "B": "劳动二重性理论",
            "C": "商品二因素理论",
            "D": "剩余价值理论"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 86
    },
    {
        "question": "(2011年考研政治真题)马克思把商品转换成货币称为\"商品的惊险的跳跃\"，\"这个跳跃如果不成功，摔坏的不是商品，但一定是商品占有者\"。这是因为只有商品变为货币( )。",
        "options": {
            "A": "私人劳动才能转化为社会劳动",
            "B": "货币才能转化为资本",
            "C": "价值才能转化为使用价值",
            "D": "抽象劳动才能转化为具体劳动"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 87
    },
    {
        "question": "(2014年考研政治真题)社会生产是连续不断进行的，这种连续不断重复的生产就是再生产。每次经济危机发生期间，总有许多企业或因产品积压或因订单缺乏等致使其无法继续进行再生产而被迫倒闭。那些因产品积压而倒闭的企业主要是由于无法实现其生产过程的( )。",
        "options": {
            "A": "实物补偿",
            "B": "劳动补偿",
            "C": "增值补偿",
            "D": "价值补偿"
        },
        "answer": [
            "D"
        ],
        "type": "single",
        "source": "",
        "id": 88
    },
    {
        "question": "(2020年考研政治真题)在相同的劳动时间内，复杂劳动创造的价值大于简单劳动创造的价值。在以私有制为基础的商品经济条件下，复杂劳动转化为简单劳动( )。",
        "options": {
            "A": "是市场管理部门事先规定的",
            "B": "是商品生产者自觉计算出来的",
            "C": "是商品交换过程中市场机制自发实现的",
            "D": "是商品生产者协商出来的"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 89
    },
    {
        "question": "(2015年考研政治真题)第二次世界大战以后，资本主义国家经历了第三次科技革命，机器大工业发展到自动化阶段。智能化工厂创造出了较高的生产效率，显露出巨大的竞争力，企业在\"机器换人\"中取得了一定的经济效益。这意味着率先使用机器人的个别企业( )。",
        "options": {
            "A": "获得更多的社会平均利润",
            "B": "剩余价值来源的改变",
            "C": "资本技术构成的提高",
            "D": "所生产商品价值的提高"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 90
    },
    {
        "question": "(2016年考研政治真题)马克思说:\"一切现实的危机的最终原因始终是:群众贫穷和群众的消费受到限制，而与此相对立，资本主义生产却竭力发展生产力，好像只有社会的绝对的消费能力才是生产力发展的界限。\"这段论述表明( )。",
        "options": {
            "A": "经济危机的发生与群众的贫穷及其消费能力受到限制有关",
            "B": "社会的绝对的消费能力导致了经济危机的发生",
            "C": "经济危机的发生根本上在于资本主义的基本矛盾",
            "D": "资本积累与无限扩大生产也是经济危机发生的原因"
        },
        "answer": [
            "A",
            "C",
            "D"
        ],
        "type": "multiple",
        "source": "",
        "id": 91
    },
    {
        "question": "(2022年考研政治真题)马克思、恩格斯在《共产党宣言》中指出:\"资产阶级在它的不到一百年的阶级统治中所创造的生产力，比过去一切世代创造的全部生产力还要多，还要大。自然力的征服，机器的采用，化学在工业和农业中的应用，轮船的行驶，铁路的通行，电报的使用，整个整个大陆的开垦，河川的通航，仿佛用法术从地下呼唤出来的大量人口------过去哪一个世纪料想到在社会劳动里蕴藏有这样的生产力呢?\"资本主义社会生产力迅速发展的主要原因是( )。",
        "options": {
            "A": "资本主义国家对市场的全面控制",
            "B": "资本追逐剩余价值的内在动力",
            "C": "无产阶级反对资产阶级的斗争",
            "D": "市场激烈竞争的外在压力"
        },
        "answer": [
            "B",
            "D"
        ],
        "type": "multiple",
        "source": "",
        "id": 92
    },
    {
        "question": "(2017年考研政治真题)马克思指出，所谓资本原始积累\"只不过是生产者和生产资料分离的历史过程。这个过程所以表现为'原始的'，因为它形成资本及与之相适应的生产方式的前史\"。资本原始积累的主要途径有( )。",
        "options": {
            "A": "用资本手段获取市场暴利",
            "B": "用暴力手段掠夺货币财富",
            "C": "用剥削手段榨取剩余价值",
            "D": "用暴力手段剥夺农民土地"
        },
        "answer": [
            "B",
            "D"
        ],
        "type": "multiple",
        "source": "",
        "id": 93
    },
    {
        "question": "(2019年考研政治真题)资本主义的生产目的是追逐利润最大化。为了获得尽可能多的利润，分布在不同部门(行业)的资本家之间必然展开激烈的竞争，而竞争的结果必将导致利润率的平均化。利润率平均化的过程意味着( )。",
        "options": {
            "A": "某企业工人创造的剩余价值有被其他资本家侵占的可能",
            "B": "各部门内不同资本家的等量投资所得到的利润大体上均等",
            "C": "不从事直接生产的银行资本家所获得的利润总是低于平均利润",
            "D": "各部门资本家在加强对工人阶级的剥削上有着共同的阶级利益"
        },
        "answer": [
            "A",
            "D"
        ],
        "type": "multiple",
        "source": "",
        "id": 94
    },
    {
        "question": "(2021年考研政治真题)某服装厂为了实现更高的盈利，将原本依靠人工进行生产的流水线改造成了完全依靠机器进行生产的流水线。与此同时，由于受经济危机的影响，该服装厂从市场上采购的布料等生产原料价格也出现了大幅度的下降。在这种情况下，该服装厂资本构成会发生变化的是( )。",
        "options": {
            "A": "资本价值构成",
            "B": "资本积累构成",
            "C": "资本有机构成",
            "D": "资本技术构成"
        },
        "answer": [
            "A",
            "C",
            "D"
        ],
        "type": "multiple",
        "source": "",
        "id": 95
    },
    {
        "question": "(2018年考研政治真题)为了追逐最大化的利润，资本家总是想方设法地进行资本积累，而资本积累的源泉是剩余价值。一般而言，资本积累规模的大小取决于( )。",
        "options": {
            "A": "劳动生产率的高低",
            "B": "资本家对工人的剥削程度",
            "C": "资本家垫付资本的大小",
            "D": "所用资本与所费资本之间的差额"
        },
        "answer": [
            "A",
            "B",
            "C",
            "D"
        ],
        "type": "multiple",
        "source": "",
        "id": 96
    },
    {
        "question": "(2023年考研政治真题)马克思的平均利润理论深刻阐明了资本主义社会利润转化为平均利润，以及剩余价值被进一步分割的原理。在利润率平均化的过程中，依旧可以获得平均利润的资本是( )。",
        "options": {
            "A": "产业资本",
            "B": "借贷资本",
            "C": "商业资本",
            "D": "农业资本"
        },
        "answer": [
            "A",
            "C",
            "D"
        ],
        "type": "multiple",
        "source": "",
        "id": 97
    },
    {
        "question": "(2014年考研政治真题)1918年，马寅初在一次演讲时，有一位老农问他:\"马教授，请问什么是经济学?\"马寅初笑着说:\"我给这位朋友讲个故事吧:有个赶考的书生到旅店投宿，拿出十两银子，挑了该旅店标价十两银子的最好房间，店主立刻用它到隔壁的米店付了欠单。米店老板转身去屠夫处还了肉钱，屠夫马上去付清了赊欠的饲料款，饲料商赶紧到旅店还了房钱。就这样，十两银子又回到了店主的手里。这时书生来说房间不合适，要回银子就走了。你看店主一文钱也没赚到，大家却把债务都还清了，所以钱的流通越快越好，这就是经济学。\"在这个故事中，货币所发挥的职能有( )。",
        "options": {
            "A": "储藏手段",
            "B": "支付手段",
            "C": "流通手段",
            "D": "价值尺度"
        },
        "answer": [
            "B",
            "C",
            "D"
        ],
        "type": "multiple",
        "source": "",
        "id": 98
    },
    {
        "question": "(2020年考研政治真题)资本循环是资本实现价值增殖的重要前提。所谓资本循环，是指资本从一种形式出发，经过一系列形式的变化，又回到原来出发点的运动。产业资本循环过程中在空间上同时存在的资本形式有( )。",
        "options": {
            "A": "货币资本",
            "B": "借贷资本",
            "C": "商品资本",
            "D": "生产资本"
        },
        "answer": [
            "A",
            "C",
            "D"
        ],
        "type": "multiple",
        "source": "",
        "id": 99
    },
    {
        "question": "(2015年考研政治真题)马克思指出:\"资本主义积累不断地并且同它的能力和规模成比例地生产出相对的，即超过资本增殖的平均需要的，因而是过剩的或追加的工人人口。\"\"过剩的工人人口是积累或资本主义基础上的财富发展的必然产物，但是这种过剩人口反过来又成为资本主义积累的杠杆，甚至成为资本主义生产方式存在的一个条件。\"上述论断表明( )。",
        "options": {
            "A": "资本主义生产周期性特征需要有相对过剩的人口规律与之相适应",
            "B": "资本主义积累使得资本主义社会的人口失业规模呈现越来越大的趋势",
            "C": "资本主义社会过剩人口之所以是相对的，是因为它不为资本价值增殖所需要",
            "D": "资本主义积累必然导致工人人口的供给相对于资本的需要而过剩"
        },
        "answer": [
            "B",
            "C",
            "D"
        ],
        "type": "multiple",
        "source": "",
        "id": 100
    },
    {
        "question": "垄断资本在国内建立了垄断统治之后，为了将国内过剩的资本输出，争夺商品销售市场以及确保原材料和能源来源。必然要将其统治势力范围从国内扩展到国外，建立国际垄断统治。垄断资本向世界范围扩展的基本形式是( )。",
        "options": {
            "A": "金融资本输出",
            "B": "生产资本输出",
            "C": "产业资本输出",
            "D": "商业资本输出"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 101
    },
    {
        "question": "(2014年考研政治真题)与第二次世界大战前的资本主义相比，当代资本主义在许多方面已经并正在发生着深刻的变化。正确分析这些新变化的原因，有利于我们科学而全面地认识当代资本主义社会。导致当代资本主义新变化发生的根本推动力量是( )。",
        "options": {
            "A": "改良主义政党对资本主义制度的改革",
            "B": "科学技术革命和生产力的发展",
            "C": "工人阶级争取自身权利的斗争",
            "D": "社会主义制度的优越性对资本主义的影响"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 102
    },
    {
        "question": "(2022年考研政治真题)与第二次世界大战前的资本主义相比，当代资本主义在许多方面已经并正在发生着深刻的变化，当代资本主义社会，大公司经营活动的实际控制者是( )。",
        "options": {
            "A": "董事长",
            "B": "监事会",
            "C": "股东大会",
            "D": "高级职业经理"
        },
        "answer": [
            "D"
        ],
        "type": "single",
        "source": "",
        "id": 103
    },
    {
        "question": "(2021年考研政治真题)马克思指出，资本主义在发展\"社会劳动的生产力\"的同时，也\"不自觉地创造着一种更高级的生产形式的物质条件\"。这表明( )。",
        "options": {
            "A": "资本主义生产方式能够无限制解放和发展生产力",
            "B": "资本主义生产是一种历史的、过渡性生产形式",
            "C": "资本越扩张越不利于创造更多的物质财富",
            "D": "资本越发展越有利于巩固资本主义"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 104
    },
    {
        "question": "(2023年考研政治真题)垄断组织通过制定垄断价格来获得垄断利润。在市场交易过程中，垄断组织获利高低实际上受到很多因素的影响。为了避免遭受净亏损，垄断组织所能接受的最低价格是( )。",
        "options": {
            "A": "生产价格",
            "B": "成本价格",
            "C": "垄断低价",
            "D": "垄断高价"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 105
    },
    {
        "question": "(2017年考研政治真题)从历史发展的角度来看，资本主义生产资料所有制是不断演进和变化的。当今资本主义社会居主导地位的资本所有制形式是( )。",
        "options": {
            "A": "垄断资本私人所有制",
            "B": "私人股份资本所有制",
            "C": "法人资本所有制",
            "D": "私人资本所有制"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 106
    },
    {
        "question": "进入21世纪以来，随着经济全球化的深入发展，新一轮科技革命和产业革 命进入空前密集活跃期，社会化大生产以更大的规模、更广的范围和更深的层次为 特征在世界范围内展开，世界格局深度调整。在这一时期，当代资本主义呈现出的新特征是( )。",
        "options": {
            "A": "社会极端思潮抬头",
            "B": "形成对石油等能源的垄断",
            "C": "经济虚拟化程度提升",
            "D": "福利风险增加"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 107
    },
    {
        "question": "在资本主义生产发展和生产规模不断扩大的过程中，生产和资本不断集中。从根本上来说，生产集中和资本集中是( )的结果。",
        "options": {
            "A": "资本家对雇佣劳动者加强剥削",
            "B": "资本家对剩余价值的追求",
            "C": "资本家之间激烈的竞争",
            "D": "资本家不断进行资本积累扩大生产规模"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 108
    },
    {
        "question": "列宁曾指出:\"以自由竞争为基础的旧资本主义已被这场战争彻底摧毁，它已经让位于国家垄断资本主义。\"国家垄断资本主义的产生，是垄断资本主义生产关系在自身范围内的部分质变，标志着资本主义发展进入了新的阶段。国家垄断资本主义最终得以确立的标志是( )。",
        "options": {
            "A": "1933年罗斯福实施\"新政\",加强政府对经济生活的干预",
            "B": "部分资本主义国家在第一次世界大战期间推行国民经济军事化",
            "C": "第二次世界大战后国家干预深入资本主义再生产的各个环节",
            "D": "第二次世界大战期间帝国主义国家对国民经济和社会生活实行全面统治"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 109
    },
    {
        "question": "列宁在《帝国主义是资本主义的最高阶段》中指出:\"金融资本对其他一切形式的资本的优势，意味着食利者和金融寡头占统治地位，意味着少数拥有金融'实力'的国家处于和其余一切国家不同的特殊地位。\"金融寡头在掌握了经济上的控制权后，又通过各种方式进一步控制上层建筑。这些方式包括( )。",
        "options": {
            "A": "掌握其他企业的控股权",
            "B": "聘请政府官员成为企业独立董事",
            "C": "向其他企业派驻高级管理人员",
            "D": "资助一家足球俱乐部"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 110
    },
    {
        "question": "(2016年考研政治真题)20世纪80年代以来，随着冷战的结束，分割的世界经济体系也随之被打破，技术、资本、商品等真正实现了全球范围的流动，各国之间的经济联系日益密切，相互合作、相互依存大大加强，世界进入到经济全球化迅猛发展的新时代。促使经济全球化迅猛发展的因素有( )。",
        "options": {
            "A": "科学技术的进步和生产力的快速发展",
            "B": "企业不断进行的技术创新与管理创新",
            "C": "各国经济体制变革供给出的有利制度条件",
            "D": "出现了适宜于全球化的企业组织形式"
        },
        "answer": [
            "A",
            "C",
            "D"
        ],
        "type": "multiple",
        "source": "",
        "id": 111
    },
    {
        "question": "(2019年考研政治真题)资本主义必然为社会主义所代替，并不意味着资本主义将在短期内自行消亡。资本主义向社会主义的过渡必然是一个复杂的、长期的历史过程，其原因在于( )。",
        "options": {
            "A": "任何社会形态的存在都有绝对稳定性",
            "B": "资本主义的发展具有不平衡性",
            "C": "当代资本主义的发展还显示出生产关系对生产力的容纳空间",
            "D": "资本主义社会具有一定的自我调节能力"
        },
        "answer": [
            "B",
            "C",
            "D"
        ],
        "type": "multiple",
        "source": "",
        "id": 112
    },
    {
        "question": "(2020年考研政治真题)为了加强对各国垄断资本的协调和制约，第二次世界大战后，国际垄断资本建立了国际货币基金组织、世界银行和世界贸易组织等国际经济机构。这些国际经济机构在协调和合作的基础上促进了经济全球化的发展，主要表现在( )。",
        "options": {
            "A": "加强了各国和各经济体之间的联系",
            "B": "推动了商品和服务贸易的迅速增加",
            "C": "有效应对全球性经济波动和经济危机",
            "D": "加快了资本和技术等要素的国际流动"
        },
        "answer": [
            "A",
            "B",
            "D"
        ],
        "type": "multiple",
        "source": "",
        "id": 113
    },
    {
        "question": "当今世界，正在经历一场百年未有之大变局，国际格局和国际体系深刻调整，全球治理体系深刻变革，国际力量对比正在发生近代以来最具革命性的变化，世界进入新的动荡变革期。资本主义经济、政治和社会各方面的矛盾和冲突日益明显，具体表现为( )。",
        "options": {
            "A": "政党博弈愈演愈烈，缺乏理性和包容的\"否决政治\"盛行",
            "B": "贫富差距不断扩大，社会各阶层之间的健康流动\"凝固化\"",
            "C": "金融业以高于实体经济增长率数倍的速度扩张，产业空心化趋势日益加深",
            "D": "信息技术革命对生产力的促进作用衰减，新的经济增长动力尚未形成"
        },
        "answer": [
            "A",
            "B",
            "C"
        ],
        "type": "multiple",
        "source": "",
        "id": 114
    },
    {
        "question": "(2023年考研政治真题)自20世纪70年代由美国主导的布雷顿森林体系崩溃以来，资本主义国家金融垄断资本获得了快速发展。金融垄断资本得以形成和壮大的重要制度条件是( )。",
        "options": {
            "A": "金融自由化",
            "B": "金融创新",
            "C": "金融市场管制加强",
            "D": "金融危机频繁发生"
        },
        "answer": [
            "A",
            "B"
        ],
        "type": "multiple",
        "source": "",
        "id": 115
    },
    {
        "question": "(2018年考研政治真题)与第二次世界大战之前的资本主义相比，当代资本主义生产关系中的社会阶层、阶级结构发生了许多新的变化。主要表现在( )。",
        "options": {
            "A": "知识型和服务型劳动者数量随科技革命不断深入而持续地增加",
            "B": "资本家由从前的直接生产经营者变成了以剪息票为生的食利者",
            "C": "职工持股和参与决策使得劳动者成为资本家集团的重要力量",
            "D": "高级职业经理成为资本主义社会大公司经营活动的实际控制者"
        },
        "answer": [
            "A",
            "B",
            "D"
        ],
        "type": "multiple",
        "source": "",
        "id": 116
    },
    {
        "question": "(2014年考研政治真题)第二次世界大战结束以来，随着国家垄断资本主义的形成和发展，资产阶级国家对经济进行的干预明显加强，从而使得资本主义社会的经济调节机制发生了显著变化。与这种变化相适应，经济危机形态也发生了很大变化，其主要表现是( )。",
        "options": {
            "A": "经济危机通常由国家间的贸易失衡直接引发",
            "B": "经济危机的破坏作用只局限于发达资本主义国家",
            "C": "经济危机各阶段的交替过程已不十分明显",
            "D": "经济危机更多地表现为金融危机的频繁发生"
        },
        "answer": [
            "C",
            "D"
        ],
        "type": "multiple",
        "source": "",
        "id": 117
    },
    {
        "question": "资本主义的发展经历了两个阶段:自由竞争资本主义和垄断资本主义。19世纪70年代以前，资本主义处于自由竞争阶段;从19世纪70年代开始，自由竞争资本主义逐步向垄断资本主义发展;19世纪末20世纪初，垄断代替竞争并占据统治地位，垄断资本主义得以形成。垄断资本主义形成的基础有( )。",
        "options": {
            "A": "资本积累",
            "B": "资本积聚",
            "C": "生产集中",
            "D": "资本集中"
        },
        "answer": [
            "C",
            "D"
        ],
        "type": "multiple",
        "source": "",
        "id": 118
    },
    {
        "question": "列宁指出:\"帝国主义，或金融资本时代，是高度发展的资本主义经济，这时资本家的垄断同盟------辛迪加、卡特尔、托拉斯已具有决定的意义，大量积聚的银行资本已和工业资本融合起来，资本向外国的输出已发展到很大的规模，一些最富裕的国家已把全世界的领土瓜分完毕，国际托拉斯已开始从经济上瓜分世界。\"资本主义发展到垄断资本主义，进而发展到帝国主义，具有哪些基本特征( )。",
        "options": {
            "A": "垄断组织在经济生活中起决定性作用",
            "B": "在金融资本的基础上形成金融寡头的统治",
            "C": "垄断资本对内通过\"参与制\"控制国家经济命脉",
            "D": "垄断资本对外运用经济、政治甚至是战争的手段进行扩张"
        },
        "answer": [
            "A",
            "B"
        ],
        "type": "multiple",
        "source": "",
        "id": 119
    },
    {
        "question": "(2015年考研政治真题)国家垄断资本主义是国家政权和私人垄断资本融合在一起的垄断资本主义。第二次世界大战结束以来，在国家垄断资本主义获得充分发展的同时，资本主义国家通过宏观调节和微观规制对生产、流通、分配和消费各个环节的干预也更加深入。其中，微观规制的类型主要有( )。",
        "options": {
            "A": "公共事业规制",
            "B": "社会经济规制",
            "C": "公众生活规制",
            "D": "反托拉斯法"
        },
        "answer": [
            "A",
            "B",
            "D"
        ],
        "type": "multiple",
        "source": "",
        "id": 120
    },
    {
        "question": "从1918年夏到1921年春，列宁领导的苏维埃政权实行了以余粮收集制和取消商品货币关系为主要特征的政策，这一政策被称为( )。",
        "options": {
            "A": "计划经济政策",
            "B": "新经济政策",
            "C": "市场经济政策",
            "D": "战时共产主义政策"
        },
        "answer": [
            "D"
        ],
        "type": "single",
        "source": "",
        "id": 121
    },
    {
        "question": "(2020年考研政治真题)十月革命之前，列宁总结当时变化了的新情况，得出\"社会主义可能首先在少数甚至在单独一个资本主义国家内获得胜利\"的结论。列宁得出这个结论的理论依据是( )。",
        "options": {
            "A": "资本主义经济和政治发展不平衡规律",
            "B": "科学社会主义理论的广泛传播",
            "C": "资本主义国家的不断衰落",
            "D": "无产阶级力量的不断壮大"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 122
    },
    {
        "question": "《共产党宣言》的发表标志着科学社会主义的诞生，这一划时代的著作发表于( )。",
        "options": {
            "A": "1871年",
            "B": "1872年",
            "C": "1864年",
            "D": "1848年"
        },
        "answer": [
            "D"
        ],
        "type": "single",
        "source": "",
        "id": 123
    },
    {
        "question": "俄国十月社会主义革命的胜利，开创了世界历史的新纪元，使科学社会主义开始( )。",
        "options": {
            "A": "从空想变为科学",
            "B": "从一种模式变为多种模式",
            "C": "从一国变为多国",
            "D": "从理论变为现实"
        },
        "answer": [
            "D"
        ],
        "type": "single",
        "source": "",
        "id": 124
    },
    {
        "question": "在共产主义社会的第一阶段，还存在旧的社会分工，存在脑力劳动和体力劳动的差别，劳动还是谋生的手段，因此个人消费品的分配应当实行( )。",
        "options": {
            "A": "各尽所能，按需分配",
            "B": "按权力和地位分配",
            "C": "按资分配",
            "D": "各尽所能，按劳分配"
        },
        "answer": [
            "D"
        ],
        "type": "single",
        "source": "",
        "id": 125
    },
    {
        "question": "巴黎公社革命是无产阶级反对资产阶级、夺取政权的第一次伟大尝试，这一伟大革命发生在( )。",
        "options": {
            "A": "1871年",
            "B": "1872年",
            "C": "1864年",
            "D": "1848年"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 126
    },
    {
        "question": "毛泽东提出要以苏联的经验教训为鉴戒，独立探索适合中国国情的社会主义建设道路，标志着中国共产党对怎样建设社会主义新认识的开端。代表中国共产党独立探索适合中国国情的社会主义建设道路的标志性著作有( )。",
        "options": {
            "A": "《矛盾论》《实践论》",
            "B": "《反对本本主义》《改造我们的学习》",
            "C": "《论联合政府》《论人民民主专政》",
            "D": "《论十大关系》《关于正确处理人民内部矛盾的问题》"
        },
        "answer": [
            "D"
        ],
        "type": "single",
        "source": "",
        "id": 127
    },
    {
        "question": "1516年，空想社会主义的开山之作《乌托邦》问世，这一著作的作者是( )。",
        "options": {
            "A": "摩莱里",
            "B": "马布利",
            "C": "托马斯·莫尔",
            "D": "康帕内拉"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 128
    },
    {
        "question": "在社会主义思想史上，率先提出以\"和谐社会\"代替资本主义的空想社会主义思想家是( )。",
        "options": {
            "A": "圣西门",
            "B": "欧文",
            "C": "康帕内拉",
            "D": "傅立叶"
        },
        "answer": [
            "D"
        ],
        "type": "single",
        "source": "",
        "id": 129
    },
    {
        "question": "19世纪上半叶空想社会主义的代表人物主要有( )。",
        "options": {
            "A": "康帕内拉、托马斯·闵采尔",
            "B": "圣西门、傅立叶、欧文",
            "C": "托马斯·莫尔、马布利",
            "D": "马布利、摩莱里等人"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 130
    },
    {
        "question": "(2019年考研政治真题)习近平指出:\"当代中国的伟大社会变革，不是简单延续我国历史文化的母版，不是简单套用马克思主义经典作家设想的模板，不是其他国家社会主义实践的再版，也不是国外现代化发展的翻版。\"这对我们理解科学社会主义一般原则的启示是( )。",
        "options": {
            "A": "科学社会主义是人类优秀文化传统的历史延续",
            "B": "科学社会主义在不同的时代具有不同的内容和形式",
            "C": "科学社会主义绝不是一成不变的教条",
            "D": "科学社会主义与资本主义生产方式没有必然的联系"
        },
        "answer": [
            "A",
            "B",
            "C"
        ],
        "type": "multiple",
        "source": "",
        "id": 131
    },
    {
        "question": "列宁领导的苏维埃俄国对社会主义道路的探索大体上经历了三个时期，即( )。",
        "options": {
            "A": "进一步巩固苏维埃政权时期",
            "B": "新经济政策时期",
            "C": "战时共产主义时期",
            "D": "全面建设社会主义时期"
        },
        "answer": [
            "A",
            "B",
            "C"
        ],
        "type": "multiple",
        "source": "",
        "id": 132
    },
    {
        "question": "(2023年考研政治真题)十月革命胜利后，为捍卫年轻的苏维埃政权，列宁领导的苏维埃政权从1918年夏到1921年春实行了战时共产主义政策。战时共产主义政策是苏维埃俄国面临帝国主义武装干涉和国内战争而被迫采取的一种临时性政策。战时共产主义政策的主要内容有( )。",
        "options": {
            "A": "发展多种所有制",
            "B": "取消商品货币关系",
            "C": "余粮收集制",
            "D": "支持农民耕种自留地"
        },
        "answer": [
            "B",
            "C"
        ],
        "type": "multiple",
        "source": "",
        "id": 133
    },
    {
        "question": "社会主义发展道路具有多样性，探索适合本国国情的社会主义道路是无产阶级政党的神圣使命。如同任何实践都需要正确的理论指导一样，探索适合国情的社会主义道路也需要正确的理论指导，但是在探索时要注意下列几个方面( )。",
        "options": {
            "A": "必须把坚持社会主义的一般原则与本国的国情创造性地结合起来",
            "B": "必须坚持对待马克思主义的科学态度",
            "C": "必须从当时当地的历史条件出发，坚持\"走自己的路\"",
            "D": "必须充分吸收人类一切文明成果"
        },
        "answer": [
            "A",
            "B",
            "C",
            "D"
        ],
        "type": "multiple",
        "source": "",
        "id": 134
    },
    {
        "question": "(2018年考研政治真题)列宁指出:\"一切民族都将走向社会主义，这是不可避免的，但是一切民族的走法却不会完全一样，在民主的这种或那种形式上，在无产阶级专政的这种或那种形态上，在社会生活各方面的社会主义改造的速度上，每个民族都会有自己的特点。\"这一论述从历史唯物主义的高度揭示了各民族发展道路的多样性的内涵。下列关于社会主义发展道路多样性特点的正确观点有( )。",
        "options": {
            "A": "各国生产力发展状况和社会发展阶段决定了社会主义发展道路具有不同的特点",
            "B": "时代和实践的不断发展是造成社会主义发展道路多样性的现实原因",
            "C": "历史文化传统的差异性是造成不同国家社会主义发展道路多样性的重要条件",
            "D": "各国民族因素和地理环境的不同是造成社会主义发展道路多样性的决定因素"
        },
        "answer": [
            "A",
            "B",
            "C"
        ],
        "type": "multiple",
        "source": "",
        "id": 135
    },
    {
        "question": "(2017年考研政治真题)1921年3月，俄共(布)召开十大，决定从战时共产主义政策过渡到新经济政策。在实施新经济政策期间，列宁对苏维埃俄国如何建设社会主义进行了深刻的理论思考，提出了许多精辟的论断，其主要内容包括( )。",
        "options": {
            "A": "把建设社会主义作为一个长期探索、不断实践的过程",
            "B": "允许多种经济成分并存，可以利用商品、货币和市场发展经济",
            "C": "可以利用资本主义来建设社会主义",
            "D": "把大力发展生产力、提高劳动生产率放在首要地位"
        },
        "answer": [
            "A",
            "B",
            "C",
            "D"
        ],
        "type": "multiple",
        "source": "",
        "id": 136
    },
    {
        "question": "经济文化相对落后国家建设社会主义具有长期性艰巨性，因为( )。",
        "options": {
            "A": "生产力发展状况的制约",
            "B": "执政党对社会主义发展道路的探索和建设规律的认识，需要一个长期的过程",
            "C": "经济基础和上层建筑发展状况的制约",
            "D": "国际环境的严峻挑战"
        },
        "answer": [
            "A",
            "B",
            "C",
            "D"
        ],
        "type": "multiple",
        "source": "",
        "id": 137
    },
    {
        "question": "(2016年考研政治真题)1516年，英国人托马斯·莫尔发表了《乌托邦》一书，标志着空想社会主义的诞生。1848年，马克思、恩格斯发表了《共产党宣言》,标志着科学社会主义的产生，社会主义实现了从空想到科学的历史性飞跃。科学社会主义超越空想社会主义之处在于( )。",
        "options": {
            "A": "对资本主义进行了无情的批判",
            "B": "揭示了资本主义必然灭亡的经济根源",
            "C": "找到了实现理想社会的现实道路",
            "D": "对未来社会进行了细致的描绘"
        },
        "answer": [
            "B",
            "C"
        ],
        "type": "multiple",
        "source": "",
        "id": 138
    },
    {
        "question": "(2021年考研政治真题)1871年爆发的巴黎公社革命，是无产阶级夺取政权的第一次伟大尝试。马克思、恩格斯深刻总结了巴黎公社的经验，高度评价了巴黎公社的意义。马克思、恩格斯总结的巴黎公社的经验主要有( )。",
        "options": {
            "A": "无产阶级政权是为人民服务的机关",
            "B": "必须打碎旧的国家机器，建立无产阶级的新型国家",
            "C": "无产阶级革命取得成功并保持胜利果实的首要条件是要有革命的武装",
            "D": "必须建立无产阶级政党，发挥党的政治领导作用"
        },
        "answer": [
            "A",
            "B",
            "C",
            "D"
        ],
        "type": "multiple",
        "source": "",
        "id": 139
    },
    {
        "question": "19世纪三四十年代，最能表现无产阶级高度政治觉悟与英勇精神，显示工人阶级在政治斗争上的威力，并标志着现代无产阶级作为独立的政治力量已经登上了历史舞台的工人运动有( )。",
        "options": {
            "A": "1871年法国巴黎公社革命",
            "B": "1831年和1834年法国里昂工人两次起义",
            "C": "1838年在英国爆发并延续长达十余年的宪章运动",
            "D": "1844年在德国西里西亚纺织工人起义"
        },
        "answer": [
            "B",
            "C",
            "D"
        ],
        "type": "multiple",
        "source": "",
        "id": 140
    },
    {
        "question": "在共产主义社会的高级阶段，个人消费品的分配方式是( )。",
        "options": {
            "A": "按资分配",
            "B": "各尽所能，按需分配",
            "C": "按生产要素分配",
            "D": "按劳分配"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 141
    },
    {
        "question": "下列关于共产主义社会的观点中错误的是( )。",
        "options": {
            "A": "在共产主义社会，阶级消失",
            "B": "在共产主义社会，社会公共机构消失",
            "C": "在共产主义社会，国家将消亡",
            "D": "在共产主义社会，战争不复存在"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 142
    },
    {
        "question": "社会主义社会是共产主义社会的( ),它与共产主义社会具有根本性质上的一致性。",
        "options": {
            "A": "高级阶段",
            "B": "萌芽阶段",
            "C": "发展阶段",
            "D": "初级阶段"
        },
        "answer": [
            "D"
        ],
        "type": "single",
        "source": "",
        "id": 143
    },
    {
        "question": "在共产主义社会，劳动是( )。",
        "options": {
            "A": "单纯的谋生手段",
            "B": "生活的第一需要",
            "C": "强迫性的活动",
            "D": "一种娱乐和消遣"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 144
    },
    {
        "question": "马克思主义产生以前曾对未来理想社会进行过详尽描述的是( )。",
        "options": {
            "A": "空想社会主义",
            "B": "封建的社会主义",
            "C": "基督教社会主义",
            "D": "小资产阶级社会主义"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 145
    },
    {
        "question": "在展望未来社会的问题上，马克思主义与空想社会主义的根本区别在于( )。",
        "options": {
            "A": "是否深刻地批判资本主义社会",
            "B": "是否坚持科学的立场、观点和方法",
            "C": "是否提出具体的变革措施",
            "D": "是否详尽地描述未来的理想社会"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 146
    },
    {
        "question": "马克思主义最崇高的社会理想和人类历史发展的必然趋势是( )。",
        "options": {
            "A": "消灭资本主义",
            "B": "实现共产主义",
            "C": "发展生产力",
            "D": "建立社会主义"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 147
    },
    {
        "question": "( )是人类历史发展的必然趋势，是马克思主义最崇高的社会理想。",
        "options": {
            "A": "进行新民主主义革命",
            "B": "消灭个人主义",
            "C": "建设社会主义",
            "D": "实现共产主义"
        },
        "answer": [
            "D"
        ],
        "type": "single",
        "source": "",
        "id": 148
    },
    {
        "question": "我们说共产主义理想能够实现，因为这是( )。",
        "options": {
            "A": "由社会主义建设所决定的",
            "B": "由人类社会发展规律所决定的",
            "C": "由阶级矛盾所决定的",
            "D": "由资本主义发展趋势决定的"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 149
    },
    {
        "question": "马克思主义追求的根本价值目标是( )。",
        "options": {
            "A": "人的个性的充分实现",
            "B": "人对自然规律的掌握",
            "C": "劳动成为生活的第一需要",
            "D": "人的自由而全面的发展"
        },
        "answer": [
            "D"
        ],
        "type": "single",
        "source": "",
        "id": 150
    },
    {
        "question": "我们说的共产主义，是指一种( )。",
        "options": {
            "A": "现实的运动",
            "B": "未来的社会制度",
            "C": "科学的理论",
            "D": "没有矛盾的社会形态"
        },
        "answer": [
            "A",
            "B",
            "C"
        ],
        "type": "multiple",
        "source": "",
        "id": 151
    },
    {
        "question": "到共产主义社会，国家将消亡。这是指( )。",
        "options": {
            "A": "社会组织管理机构的消亡",
            "B": "作为阶级压迫工具的国家机器的消亡",
            "C": "政治国家的消亡",
            "D": "阶级消亡"
        },
        "answer": [
            "B",
            "C"
        ],
        "type": "multiple",
        "source": "",
        "id": 152
    },
    {
        "question": "实现共产主义是长期的历史过程，这是因为( )。",
        "options": {
            "A": "从发达的社会主义向共产主义的转变和过渡需要一定的历史时期",
            "B": "社会主义社会有一个长期发展的过程",
            "C": "从资本主义到社会主义有一个长时间的过渡时期",
            "D": "资本主义从兴盛走向衰落需要相当长的历史时期"
        },
        "answer": [
            "A",
            "B",
            "C",
            "D"
        ],
        "type": "multiple",
        "source": "",
        "id": 153
    },
    {
        "question": "共产主义远大理想与中国特色社会主义共同理想的关系从时间上看是( )。",
        "options": {
            "A": "未来与现实的关系",
            "B": "最高纲领与最低纲领的关系",
            "C": "全人类理想和全体中国人民理想的关系",
            "D": "最终理想与阶段性理想的关系"
        },
        "answer": [
            "A",
            "D"
        ],
        "type": "multiple",
        "source": "",
        "id": 154
    },
    {
        "question": "在共产主义社会，社会关系之所以能够实现高度和谐，是因为( )。",
        "options": {
            "A": "人与自然矛盾消除",
            "B": "国家消亡",
            "C": "阶级消灭",
            "D": "三大差别消失"
        },
        "answer": [
            "B",
            "C",
            "D"
        ],
        "type": "multiple",
        "source": "",
        "id": 155
    },
    {
        "question": "以下关于社会主义社会分配的正确说法有( )。",
        "options": {
            "A": "默认劳动者不同等的个人天赋",
            "B": "各尽所能、按劳分配",
            "C": "各尽所能、按需分配",
            "D": "没有实现分配的真正平等"
        },
        "answer": [
            "A",
            "B",
            "D"
        ],
        "type": "multiple",
        "source": "",
        "id": 156
    },
    {
        "question": "马克思主义经典作家揭示的共产主义的基本特征包括( )。",
        "options": {
            "A": "实现每个人自由而全面的发展",
            "B": "物质财富极大丰富，消费资料按需分配",
            "C": "社会关系高度和谐，人们精神境界极大提高",
            "D": "人类从必然王国向自由王国飞跃"
        },
        "answer": [
            "A",
            "B",
            "C",
            "D"
        ],
        "type": "multiple",
        "source": "",
        "id": 157
    },
    {
        "question": "共产主义理想实现的必然性可以通过( )得到证明。",
        "options": {
            "A": "人民思想道德水平的提高",
            "B": "生产力的不断发展",
            "C": "社会主义国家的兴起和不断发展",
            "D": "社会主义革命的胜利"
        },
        "answer": [
            "C",
            "D"
        ],
        "type": "multiple",
        "source": "",
        "id": 158
    },
    {
        "question": "把握共产主义社会的基本特征可以从( )方面展开。",
        "options": {
            "A": "生产力状况",
            "B": "社会生活状况",
            "C": "精神生活状况",
            "D": "生产关系状况"
        },
        "answer": [
            "A",
            "B",
            "C",
            "D"
        ],
        "type": "multiple",
        "source": "",
        "id": 159
    },
    {
        "question": "关于未来社会\"人的自由而全面的发展\"是指( )。",
        "options": {
            "A": "人的体力和智力得到发展",
            "B": "人摆脱了商品经济条件下对\"物的依赖性\"",
            "C": "人摆脱了自然经济条件下对\"人的依赖关系\"",
            "D": "全体社会成员的共同发展，即每一个人的发展"
        },
        "answer": [
            "A",
            "B",
            "C",
            "D"
        ],
        "type": "multiple",
        "source": "",
        "id": 160
    }
]
  },
  os: {
    name: "操作系统",
    questions: [
    {
        "question": "单道批处理系统的主要缺点是( )。",
        "options": {
            "A": "CPU利用率不高",
            "B": "失去了交互性",
            "C": "不具备并行性",
            "D": "以上都不是"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 1
    },
    {
        "question": "提高单机资源利用率的关键技术是( )。",
        "options": {
            "A": "脱机技术",
            "B": "虚拟技术",
            "C": "交换技术",
            "D": "多道程序设计技术"
        },
        "answer": [
            "D"
        ],
        "type": "single",
        "source": "",
        "id": 2
    },
    {
        "question": "并发性是指若干事件在( )发生。",
        "options": {
            "A": "同一时刻",
            "B": "不同时刻",
            "C": "同一时间间隔内",
            "D": "不同时间间隔内"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 3
    },
    {
        "question": "批处理系统的主要缺点是( )。",
        "options": {
            "A": "系统吞吐量小",
            "B": "CPU利用率不高",
            "C": "资源利用率低",
            "D": "无交互能力"
        },
        "answer": [
            "D"
        ],
        "type": "single",
        "source": "",
        "id": 4
    },
    {
        "question": "( )操作系统允许一台主机上同时连接多台终端，多个用户可以通过各自的终端同时交互地使用计算机。",
        "options": {
            "A": "网络",
            "B": "分布式",
            "C": "分时",
            "D": "实时"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 5
    },
    {
        "question": "实时操作系统必须在( )内处理来自外部的事件。",
        "options": {
            "A": "一个机器周期",
            "B": "被控制对象规定时间",
            "C": "周转时间",
            "D": "时间片"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 6
    },
    {
        "question": "操作系统中有一组特殊的程序，它们不能被系统中断，在操作系统中称为( )。",
        "options": {
            "A": "初始化程序",
            "B": "原语",
            "C": "子程序",
            "D": "控制模块"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 7
    },
    {
        "question": "单处理机系统中，可并行的是（ ）。 Ⅰ.进程与进程 Ⅱ.处理机与设备 Ⅲ.处理机与通道 Ⅳ.设备与设备",
        "options": {
            "A": "Ⅰ、Ⅱ、Ⅲ",
            "B": "Ⅰ、Ⅱ、Ⅳ",
            "C": "Ⅰ、Ⅲ、Ⅳ",
            "D": "Ⅱ、Ⅲ、Ⅳ"
        },
        "answer": [
            "D"
        ],
        "type": "single",
        "source": "",
        "id": 8
    },
    {
        "question": "当一个进程因等待外部事件而无法继续运行时，它将进入哪种状态?( )。",
        "options": {
            "A": "就绪状态",
            "B": "运行状态",
            "C": "阻塞状态",
            "D": "挂起状态"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 9
    },
    {
        "question": "进程和程序的本质区别是( )。",
        "options": {
            "A": "前者是动态的，后者是静态的",
            "B": "前者存储在内存，后者存储在外存",
            "C": "前者在一个文件中，后者在多个文件中",
            "D": "前者分时使用CPU，后者独占CPU"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 10
    },
    {
        "question": "进程的基本状态( )可以由其他两种基本状态转变而来。",
        "options": {
            "A": "就绪状态",
            "B": "执行状态",
            "C": "阻塞状态",
            "D": "新建状态"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 11
    },
    {
        "question": "进程处于( )时，它处于非阻塞态。",
        "options": {
            "A": "等待从键盘输入数据",
            "B": "等待协作进程的一个信号",
            "C": "等待操作系统分配CPU时间",
            "D": "等待网络数据进入内存"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 12
    },
    {
        "question": "系统调用与库函数的本质区别是( )。",
        "options": {
            "A": "系统调用需切换至内核态",
            "B": "库函数执行效率更高",
            "C": "库函数由硬件实现",
            "D": "系统调用属于应用程序"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 13
    },
    {
        "question": "程序运行时独占系统资源，只有程序本身能改变系统资源状态，这是指( )。",
        "options": {
            "A": "程序顺序执行的再现性",
            "B": "并发程序失去再现性",
            "C": "并发程序失夫封闭性",
            "D": "程序顺序执行时的封闭性"
        },
        "answer": [
            "D"
        ],
        "type": "single",
        "source": "",
        "id": 14
    },
    {
        "question": "进程和程序的本质区别在于( )。",
        "options": {
            "A": "前者分时使用CPU，或者独占CPU",
            "B": "前者存储在内存，后者存储在外存",
            "C": "前者具有异步性，后者具有可再现性",
            "D": "前者可以并发执行，后者不能并发执行"
        },
        "answer": [
            "D"
        ],
        "type": "single",
        "source": "",
        "id": 15
    },
    {
        "question": "进程的状态和优先级信息存放在( )。",
        "options": {
            "A": "JCB",
            "B": "PCB",
            "C": "快表",
            "D": "页表"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 16
    },
    {
        "question": "一个进程的读磁盘操作完成后，操作系统针对该进程必做的是( )。",
        "options": {
            "A": "修改进程状态为就绪态",
            "B": "降低进程优先级",
            "C": "进程分配用户内存空间",
            "D": "增加进程的时间片大小"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 17
    },
    {
        "question": "下列哪个调度决定了进程何时被分配给CPU?( )",
        "options": {
            "A": "高级调度",
            "B": "中级调度",
            "C": "低级调度",
            "D": "以上都不是"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 18
    },
    {
        "question": "用信箱实现进程间互通信息的通信机制要有两个通信原语，它们是( )。",
        "options": {
            "A": "发送原语和执行原语",
            "B": "就绪原语和执行原语",
            "C": "发送原语和接收原语",
            "D": "就绪原语和接收原语"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 19
    },
    {
        "question": "死锁的4个必要条件中，无法破坏的是( )。",
        "options": {
            "A": "环路等待资源",
            "B": "互斥使用资源",
            "C": "占有且等待资源",
            "D": "非抢夺式分配"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 20
    },
    {
        "question": "死锁与安全状态的关系是( )。",
        "options": {
            "A": "死锁状态有可能是安全状态",
            "B": "安全状态有可能成为死锁状态",
            "C": "不安全状态就是死锁状态",
            "D": "死锁状态一定是不安全状态"
        },
        "answer": [
            "D"
        ],
        "type": "single",
        "source": "",
        "id": 21
    },
    {
        "question": "以下有关资源分配图的描述中，正确的是( )。",
        "options": {
            "A": "有向边包括进程指向资源类的分配边和资源类指向进程申请边两类",
            "B": "矩形框表示进程，其中圆点表示申请同一类资源的各个进程",
            "C": "圆圈结点表示资源类",
            "D": "资源分配图是一个有向图，用于表示某时刻系统资源与进程之间的状态"
        },
        "answer": [
            "D"
        ],
        "type": "single",
        "source": "",
        "id": 22
    },
    {
        "question": "下列哪种调度算法可能导致某些进程长期得不到执行机会?( )。",
        "options": {
            "A": "轮转调度",
            "B": "高响应比优先",
            "C": "先来先服务",
            "D": "短作业优先"
        },
        "answer": [
            "D"
        ],
        "type": "single",
        "source": "",
        "id": 23
    },
    {
        "question": "假设4个作业到达系统的时刻和运行时间如表所示。 作业 到达时刻t 运行时间 J1 0 3 J2 1 3 J3 1 2 J4 3 1 系统在t=2时开始作业调度。若分别采用先来先服务和短作业优先调度算法，则选中的作业分别是( )。",
        "options": {
            "A": "J2、J3",
            "B": "J1、J4",
            "C": "J2、J4",
            "D": "J1、J3"
        },
        "answer": [
            "D"
        ],
        "type": "single",
        "source": "",
        "id": 24
    },
    {
        "question": "时间片轮转调度算法是为了( )。",
        "options": {
            "A": "多个用户能及时干预系统",
            "B": "使系统变得高效",
            "C": "优先级较高的进程得到及时响应",
            "D": "需要CPU时间最少"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 25
    },
    {
        "question": "下面关于死锁预防的说法中，正确的是( )。",
        "options": {
            "A": "死锁预防策略通过允许死锁的发生然后恢复系统状态",
            "B": "死锁预防策略通常会牺牲资源利用率以确保系统不会进入死锁状态",
            "C": "死锁预防策略不需要任何运行时检查",
            "D": "锁预防策略只适用于单个进程的系统"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 26
    },
    {
        "question": "下列调度算法中，不会导致饥饿现象的是( )。",
        "options": {
            "A": "时间片轮转",
            "B": "静态优先数调度",
            "C": "非抢占式短任务优先",
            "D": "抢占式短任务优先"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 27
    },
    {
        "question": "系统中有4个进程都要使用某类资源。若每个进程最多需要3个该类资源，为保证系统不发生死锁，系统应提供该类资源至少是( )。",
        "options": {
            "A": "3个",
            "B": "4个",
            "C": "9个",
            "D": "12个"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 28
    },
    {
        "question": "某计算机系统中有8台打印机，由K个进程竞争使用，每个进程最多需要3台打印机。该系统可能会发生死锁的K的最小值是( )。",
        "options": {
            "A": "2",
            "B": "3",
            "C": "4",
            "D": "5"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 29
    },
    {
        "question": "在单处理器系统中，通过哪种方式可以实现进程互斥?( )。",
        "options": {
            "A": "利用Test-and-Set指令",
            "B": "使用文件锁",
            "C": "采用时间片轮转",
            "D": "使用消息队列"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 30
    },
    {
        "question": "采用资源剥夺法可以解除死锁，还可以采用( )方法解除死锁。",
        "options": {
            "A": "执行并行操作",
            "B": "撒销进程",
            "C": "拒绝分配新资源",
            "D": "修改信号量"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 31
    },
    {
        "question": "在操作系统中，P、V操作是一种( )。",
        "options": {
            "A": "机器指令",
            "B": "系统调用命令",
            "C": "作业控制命令",
            "D": "进程低级通信原语"
        },
        "answer": [
            "D"
        ],
        "type": "single",
        "source": "",
        "id": 32
    },
    {
        "question": "进程并发地在处理机上执行时，( )。",
        "options": {
            "A": "进程之间是无关的，系统是封闭的",
            "B": "进程之间具有交互性、并发性，它们既相互依赖，又相互制约",
            "C": "进程之间可能具有交往，也可能无关",
            "D": "上述都不对"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 33
    },
    {
        "question": "记录型信号量中，当执行P操作后信号量的值小于0时，进程会( )。",
        "options": {
            "A": "立即进入临界区",
            "B": "继续执行后续指令",
            "C": "被阻塞并插入到等待队列",
            "D": "直接终止运行"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 34
    },
    {
        "question": "若记录型信号量S的初值为15，当前值为-15，则表示有( )等待进程。",
        "options": {
            "A": "15个",
            "B": "30个",
            "C": "16个",
            "D": "31个"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 35
    },
    {
        "question": "进程A和B共享同一临界资源，并且进程A正处于对应的临界区内执行。请从下列描述中选择一条正确的描述。( )",
        "options": {
            "A": "进程A的执行不能被中断，即临界区的代码具有原子性。",
            "B": "进程A的执行能被中断，但中断A后，不能将CPU调度给B进程。",
            "C": "进程A的执行能被中断，而且只要B进程就绪，就可以将CPU调度给B进程。",
            "D": "进程A的执行能被中断，而且只要B进程就绪，就必定将CPU调度给B进程。"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 36
    },
    {
        "question": "从下面对临界区的论述中，选出一条正确的论述。( )",
        "options": {
            "A": "临界区是指进程中用于实现进程同步的那段代码",
            "B": "临界区是指进程中用于实现进程通信的那段代码",
            "C": "临界区是指进程中用于访问共享资源的那段代码",
            "D": "临界区是指进程中访问临界资源的那段代码"
        },
        "answer": [
            "D"
        ],
        "type": "single",
        "source": "",
        "id": 37
    },
    {
        "question": "两个旅行社甲和乙为旅客到某航空公司订飞机票，形成互斥资源的是( )。",
        "options": {
            "A": "旅行社",
            "B": "航空公司",
            "C": "数据",
            "D": "旅行社与航空公司"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 38
    },
    {
        "question": "设与某资源相关联的信号量初值为3，当前值为1，若M表示该资源的可用个数，N表示等待资源的进程数，则M、N分别是( )。",
        "options": {
            "A": "0、1",
            "B": "1、0",
            "C": "1、2",
            "D": "2、0"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 39
    },
    {
        "question": "若系统中有 3 个并发进程共享同一临界资源，且互斥访问该资源，则实现互斥的信号量初值应设为( )。",
        "options": {
            "A": "0",
            "B": "1",
            "C": "2",
            "D": "3"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 40
    },
    {
        "question": "在对记录型信号量的P操作的定义中，当信号量的值( )时，执行P操作的进程变为阻塞状态。",
        "options": {
            "A": "大于0",
            "B": "小于0",
            "C": "等于0",
            "D": "小于或等于0"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 41
    },
    {
        "question": "如果3个进程共享一个互斥段，每次最多可以允许2个进程进入互斥段，则信号量的变化范围是( )。",
        "options": {
            "A": "2、1、0、-1",
            "B": "3、2、1、0",
            "C": "2，1、0、-1，-2",
            "D": "1、0、-1，-2"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 42
    },
    {
        "question": "在可变分区分配方案中，当某一作业完成、系统回收其主存空间时，回收分区可能存在与相邻空闲区合并的情况，为此须修改空闲分区表。其中，造成空闲分区数减1的情况是( )。",
        "options": {
            "A": "既无上邻空闲分区，也无下邻空闲分区",
            "B": "虽无上邻空闲分区，但有下邻空闲分区",
            "C": "虽有上邻空闲分区，但无下邻空闲分区",
            "D": "既有上邻空闲分区，也有下邻空闲分区"
        },
        "answer": [
            "D"
        ],
        "type": "single",
        "source": "",
        "id": 43
    },
    {
        "question": "采用动态分区算法回收内存时，如果回收区仅与空闲区链插入点前一个分区相邻接，那么需要在空闲区链表中( )。",
        "options": {
            "A": "增加一个新表项",
            "B": "修改前一个分区表项的大小",
            "C": "修改前一个分区表项的首地址",
            "D": "修改前一个分区表项的大小和首地址"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 44
    },
    {
        "question": "采用( )不会产生内部碎片。",
        "options": {
            "A": "分页式存储管理",
            "B": "分段式存储管理",
            "C": "随机存储管理",
            "D": "段页式存储管理"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 45
    },
    {
        "question": "采用分页存储管理方式进行存储分配时产生的存储碎片，被称为( )。",
        "options": {
            "A": "外零头",
            "B": "内零头",
            "C": "外零头或内零头",
            "D": "A、B、C都正确"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 46
    },
    {
        "question": "在可变分区存储管理中，采用紧凑技术的目的是( )。",
        "options": {
            "A": "便于地址变换",
            "B": "合并分配区",
            "C": "增加内存容量",
            "D": "合并空闲分区"
        },
        "answer": [
            "D"
        ],
        "type": "single",
        "source": "",
        "id": 47
    },
    {
        "question": "在页式存储管理系统中，页表内容如表所示(均从0开始编号)。 页号 块号 0 2 1 1 2 6 3 3 4 7 若页面大小为4KB，则地址变换机构将逻辑地址0转换成物理地址为( )。",
        "options": {
            "A": "8192",
            "B": "4096",
            "C": "2048",
            "D": "1024"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 48
    },
    {
        "question": "某进程的段表内容如表所示。 段号 段长 内存起始地址 权限 状态 0 100 6000 只读 在内存 1 200 — 读写 不在内存 2 300 4000 读写 在内存 当访问段号为2，段内地址为400的逻辑地址时，地址转换的结果是( )。",
        "options": {
            "A": "段缺失异常",
            "B": "得到内存地址4400",
            "C": "越权异常",
            "D": "越界异常"
        },
        "answer": [
            "D"
        ],
        "type": "single",
        "source": "",
        "id": 49
    },
    {
        "question": "可重定位内存的分区分配目的是为( )。",
        "options": {
            "A": "解决碎片问题",
            "B": "便于多作业共享内存",
            "C": "便于用户干预",
            "D": "回收空白区方便"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 50
    },
    {
        "question": "在存储管理中，采用交换技术的目的是( )。",
        "options": {
            "A": "减少程序占用的主存空间",
            "B": "物理上扩充主存容量",
            "C": "提高CPU效率",
            "D": "便于代码在主存中共享"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 51
    },
    {
        "question": "分段存储管理将用户程序的地址空间划分为若干段，每个段的长度( )。",
        "options": {
            "A": "必须相等",
            "B": "可以不等，但由操作系统固定",
            "C": "可以不等，由程序的逻辑结构决定",
            "D": "必须为2的幂次"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 52
    },
    {
        "question": "分页存储管理系统中，虚拟地址转换成物理地址的工作是由( )完成的。",
        "options": {
            "A": "地址转换程序",
            "B": "用户程序",
            "C": "硬件",
            "D": "装入程序"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 53
    },
    {
        "question": "在请求页式存储管理中，若所需页面不在内存中，则会引起( )。",
        "options": {
            "A": "输入输出中断",
            "B": "缺段中断",
            "C": "越界中断",
            "D": "页故障"
        },
        "answer": [
            "D"
        ],
        "type": "single",
        "source": "",
        "id": 54
    },
    {
        "question": "在 FIFO 页面置换算法中，若系统分配 3 个物理块，访问序列为:7, 0, 1, 2, 0, 3, 0, 4, 2, 3, 0, 3, 2, 1, 2。则产生页置换的次数(即缺页且需要换出的次数)为( )。",
        "options": {
            "A": "6",
            "B": "7",
            "C": "8",
            "D": "9"
        },
        "answer": [
            "D"
        ],
        "type": "single",
        "source": "",
        "id": 55
    },
    {
        "question": "在页式存储管理系统中，采用某些页面置换算法，会出现Belady异常现象，即进程的缺页次数会随着分配给该进程的页框个数的增加而增加。下列算法中，可能出现Belady异常现象的是( )。",
        "options": {
            "A": "FIFO算法",
            "B": "LRU算法",
            "C": "OPT算法",
            "D": "CLOCK算法"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 56
    },
    {
        "question": "系统为某进程分配了4个页框，该进程已访问的页号序列为2、0、2、9、3、4、2、8、2、4、8、4、5。若进程要访问的下一页的页号为7，依据LRU算法，应淘汰页的页号是( )。",
        "options": {
            "A": "2",
            "B": "3",
            "C": "4",
            "D": "8"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 57
    },
    {
        "question": "在页式存储管理方式中，对于逻辑页面访问请求量，最佳页面置换算法发生10次缺页，推断出其他页面置换算法可能发生的缺页次数如下，最可信的次数是( )。",
        "options": {
            "A": "FCFS 15次",
            "B": "LFU 9次",
            "C": "FIFO 6次",
            "D": "LRU 8次"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 58
    },
    {
        "question": "当系统发生抖动(thrashing)时，可以采取的有效措施是( )。 Ⅰ.撤销部分进程 Ⅱ.增加磁盘交换区的容量 Ⅲ.提高用户进程的优先级",
        "options": {
            "A": "仅Ⅰ",
            "B": "仅Ⅱ",
            "C": "仅Ⅲ",
            "D": "仅Ⅰ、Ⅱ"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 59
    },
    {
        "question": "以下哪种方法可以最有效地预防或解决系统抖动?( )",
        "options": {
            "A": "增加内存容量",
            "B": "采用更高级的页面置换算法(如 LRU)",
            "C": "采用工作集模型，确保分配给进程的物理块数不小于其工作集大小",
            "D": "减少进程的并发数，降低多道程序度"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 60
    },
    {
        "question": "下列关于内部碎片和外部碎片的叙述中，正确的是( )。",
        "options": {
            "A": "内部碎片是指内存中所有空闲分区之和小于某个进程所需的内存大小",
            "B": "外部碎片主要出现在分页存储管理系统中",
            "C": "内部碎片是分配给进程的内存区域中未被利用的部分",
            "D": "外部碎片可以通过紧缩技术完全消除"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 61
    },
    {
        "question": "下面关于虚拟存储管理的论述中，正确的是( )。",
        "options": {
            "A": "为了能让更多的进程同时运行，可以只装入10%~30%的进程映像，即启动运行",
            "B": "最佳页面置换算法是实现页式虚拟存储管理的常用算法",
            "C": "即使在多用户操作系统环境下，用户也可以运用机器指令访问任一合法的物理地址",
            "D": "为提高内存保护的灵活性，内存保护通常由软件完成"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 62
    },
    {
        "question": "请求分段系统在分段系统的基础上，增加了( )及分段置换软件功能。",
        "options": {
            "A": "请求调段",
            "B": "段表",
            "C": "缺段中断",
            "D": "地址变换"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 63
    },
    {
        "question": "实现虚拟存储器管理一般包括两个方面的支持，它们是( )。",
        "options": {
            "A": "地址变换机构和对象管理机构",
            "B": "地址变换机构和页面调度策略",
            "C": "高速缓存机构和页面调度机构",
            "D": "高速缓存机构和对象管理机构"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 64
    },
    {
        "question": "通道是一种( )。",
        "options": {
            "A": "保存 I/O 信息的部件",
            "B": "传输信息的电子线路",
            "C": "通用处理机",
            "D": "专用处理机"
        },
        "answer": [
            "D"
        ],
        "type": "single",
        "source": "",
        "id": 65
    },
    {
        "question": "I/O软件的层次结构中，哪一层负责设置设备寄存器并检查状态?( )",
        "options": {
            "A": "用户层软件",
            "B": "设备独立性软件",
            "C": "设备驱动程序",
            "D": "中断处理程序"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 66
    },
    {
        "question": "关于I/O控制方式，( )控制方式使对I/O操作的组织和数据的传送能最大限度地独立运行而无需处理机的干预。",
        "options": {
            "A": "I/O通道",
            "B": "中断驱动I/O",
            "C": "程序I/O",
            "D": "直接存储器访问I/O"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 67
    },
    {
        "question": "程序员利用系统调用打开I/O设备时，通常使用的设备标识是( )。",
        "options": {
            "A": "逻辑设备名",
            "B": "物理设备名",
            "C": "主设备号",
            "D": "从设备号"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 68
    },
    {
        "question": "设备管理程序对设备的分配和控制是借助一些表格进行的，下面的表格中( )不属于设备管理程序。",
        "options": {
            "A": "JCB",
            "B": "DCT",
            "C": "COCT",
            "D": "CHCT"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 69
    },
    {
        "question": "中央处理器启动通道后，设备的控制工作是由( )。",
        "options": {
            "A": "中央处理器执行程序来控制的",
            "B": "中央处理器执行通道程序来控制的",
            "C": "通道执行预先编好的通道程序来控制的",
            "D": "通道执行用户程序来控制的"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 70
    },
    {
        "question": "操作系统中的SPOOLing技术，实质是将( )转化为共享设备的技术。",
        "options": {
            "A": "虚拟设备",
            "B": "独占设备",
            "C": "脱机设备",
            "D": "块设备"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 71
    },
    {
        "question": "为了缓和CPU和I/O设备间速度不匹配的矛盾，提高CPU和I/O设备的并行性，现代操作系统关于I/O设备与处理机之间的数据交换几乎都用到了( )。",
        "options": {
            "A": "临界区",
            "B": "缓冲区",
            "C": "对换区",
            "D": "工作集"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 72
    },
    {
        "question": "对磁盘进行移臂调度其目的是缩短( )时间。",
        "options": {
            "A": "启动",
            "B": "数据传送",
            "C": "寻道定位",
            "D": "旋转延迟"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 73
    },
    {
        "question": "假设磁头当前位于第105道，正在向磁道号增加的方向移动。现有一个磁道访问请求序列为35、45、12、68、110、180、170、195，采用SCAN调度(电梯调度)算法得到的磁道访问序列是( )。",
        "options": {
            "A": "110、170、180、195、68、45、35、12",
            "B": "110、68、45、35、12、170、180、195",
            "C": "110、170、180、195、12、35、45、68",
            "D": "12、35、45、68、110、170、180、195"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 74
    },
    {
        "question": "下列关于磁盘调度算法的叙述中，正确的是( )。",
        "options": {
            "A": "先来先服务(FCFS)算法平均寻道时间最短",
            "B": "最短寻道时间优先(SSTF)算法可能导致饥饿现象",
            "C": "SCAN 算法(电梯算法)的磁头移动方向总是单向的",
            "D": "C-SCAN 算法与 SCAN 算法的区别在于 C-SCAN 不服务任何请求"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 75
    },
    {
        "question": "从用户的角度看，文件系统主要是实现( )。",
        "options": {
            "A": "数据存储",
            "B": "数据保护",
            "C": "数据共享",
            "D": "按名存取"
        },
        "answer": [
            "D"
        ],
        "type": "single",
        "source": "",
        "id": 76
    },
    {
        "question": "逻辑文件是( )的文件组织形式。",
        "options": {
            "A": "在外部设备上",
            "B": "从用户观点出发",
            "C": "虚拟存储",
            "D": "目录"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 77
    },
    {
        "question": "字符设备的特点不包括:( )",
        "options": {
            "A": "数据的存取和传输以字符为单位",
            "B": "不可寻址",
            "C": "通常采用DMA方式",
            "D": "采用顺序存取方式"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 78
    },
    {
        "question": "使用绝对路径名访问文件是从( )开始按目录结构访问某个文件。",
        "options": {
            "A": "当前目录",
            "B": "用户主目录",
            "C": "根目录",
            "D": "父目录"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 79
    },
    {
        "question": "在多级目录结构的文件系统中，可以通过( )和文件名进行文件访问。",
        "options": {
            "A": "索引",
            "B": "路径",
            "C": "符号",
            "D": "共享"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 80
    },
    {
        "question": "在图示的树形目录结构中，Wang用户需要经常性地访问Zhang用户的/Zhang/ Course/ Course1/f1文件，他可以通过( )来提高检索速度并简化操作过程。",
        "options": {
            "A": "将这个文件复制到Wang目录下，并仍使用原来的文件名",
            "B": "将这个文件复制到Wang目录下，但不能使用原来的文件名",
            "C": "将这个文件链接到Wang目录下，并仍使用原来的文件名",
            "D": "将这个文件链接到Wang目录下，但不能使用原来的文件名"
        },
        "answer": [
            "D"
        ],
        "type": "single",
        "source": "",
        "id": 81
    },
    {
        "question": "如果采用符号链接的方式共享文件，那么当文件被删除的时候，该共享链接会( )。",
        "options": {
            "A": "不受影响",
            "B": "失效",
            "C": "被一起删除",
            "D": "指向其他文件"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 82
    },
    {
        "question": "以下有关文件的叙述中正确的是( )。",
        "options": {
            "A": "有结构文件中的索引文件既可以满足文件动态增长的要求，又可以实现随机存取",
            "B": "顺序文件中的记录即适合顺序存取，也适合随机存取",
            "C": "一般来说，一级文件目录结构中的目录表存放在内存中",
            "D": "顺序存取方法是按记录编号存取文件任一记录"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 83
    },
    {
        "question": "符号链接实现共享的缺点是( )。",
        "options": {
            "A": "需要更多CPU资源",
            "B": "每次访问可能多次读盘",
            "C": "占用更多内存",
            "D": "降低网络速度"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 84
    },
    {
        "question": "利用( )实现文件共享时，只有文件主才拥有其索引结点的指针、而共享同一文件的其他用户仅拥有对应文件的路径名，故而不会造成文件主删除共享文件后遗留悬空指针的问题。",
        "options": {
            "A": "进程控制块",
            "B": "共享存储器",
            "C": "索引结点",
            "D": "符号链"
        },
        "answer": [
            "D"
        ],
        "type": "single",
        "source": "",
        "id": 85
    },
    {
        "question": "在 Linux中，设文件F1的当前链接计数为1，先建立F1的符号链接文件F2，再建立F1的硬链接文件F3，则此时文件F1、F2和F3的链接计数值分别是( )。",
        "options": {
            "A": "1、1、1",
            "B": "2、1、2",
            "C": "2、2、2",
            "D": "3、1、2"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 86
    },
    {
        "question": "有一个长度为3200个字节的流式文件要存储在磁盘上，磁盘的每块可以存放512个字节，该文件至少( )块。",
        "options": {
            "A": "5",
            "B": "6",
            "C": "7",
            "D": "3000"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 87
    },
    {
        "question": "按文件的物理组织结构可将文件分成( )等。",
        "options": {
            "A": "数据文件、命令文件、文本文件",
            "B": "命令文件、库文件、索引文件",
            "C": "连续文件、链式文件、索引文件",
            "D": "输入文件、输出文件、随机文件"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 88
    },
    {
        "question": "采用直接存取方法来读写硬盘上的物理记录时，效率最低的文件结构是( )。",
        "options": {
            "A": "连续文件",
            "B": "索引文件",
            "C": "链接文件",
            "D": "索引连续文件"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 89
    },
    {
        "question": "设文件索引节点中有7个地址项，其中4个地址项为直接地址索引，2个地址项是一级间接地址索引，1个地址项是二级间接地址索引，每个地址项大小为4字节，若磁盘索引块和磁盘数据块大小均为256字节，则可表示的单个文件的最大长度是( )。",
        "options": {
            "A": "33KB",
            "B": "519KB",
            "C": "1057KB",
            "D": "16513KB"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 90
    },
    {
        "question": "若用8个字(字长32位)组成的位示图管理内存，假定用户归还块号为100的内存块时，它对应位示图的位置为( )。",
        "options": {
            "A": "字号为3，块号为5",
            "B": "字号为4，块号为4",
            "C": "字号为3，块号为4",
            "D": "字号为4，块号为5"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 91
    },
    {
        "question": "下列方式中，( )不能改善磁盘系统的可靠性。",
        "options": {
            "A": "廉价磁盘冗余阵列",
            "B": "磁盘容错技术",
            "C": "磁盘高速缓存",
            "D": "后备系统"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 92
    },
    {
        "question": "从下面关于索引文件的论述中，正确的是( )。",
        "options": {
            "A": "在索引文件中，索引表的每个表项中仅保存相应记录的关键字",
            "B": "对顺序文件进行检索时，首先从FCB中读出文件的第一个盘块号;而对索引文件进行检索时，应先从FCB中读出文件索引表的始址",
            "C": "文件系统为每个文件创建一张打开文件表，存放文件数据块的磁盘存放位置",
            "D": "在文件较大时，无论进行顺序存取还是随机存取，通常都以索引文件方式为最快"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 93
    },
    {
        "question": "从下面的论述中错误的论述是( )。",
        "options": {
            "A": "虚拟盘是一种易失性存储器，因此它通常只用于存放临时文件",
            "B": "优化文件物理块的分布可显著地减少寻道时间，因此能有效地提高磁盘I/O的速度",
            "C": "对随机访问的文件，可通过提前读提高对数据的访问速度",
            "D": "延迟写可减少启动磁盘的次数，因此能等效地提高磁盘I/O的速度"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 94
    },
    {
        "question": "下列有关 I/O 通道的叙述中，正确的是( )。",
        "options": {
            "A": "I/O 通道是专门负责输入/输出工作的专用处理器，可以执行通道程序",
            "B": "I/O 通道与 DMA 一样，完全不需要 CPU 的干预即可完成所有 I/O 操作",
            "C": "I/O 通道是一种特殊的内存区域，用于暂存 I/O 数据",
            "D": "I/O 通道只能用于块设备，不能用于字符设备"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 95
    },
    {
        "question": "磁盘高速缓存设在( )中。",
        "options": {
            "A": "内存",
            "B": "磁盘控制器",
            "C": "Cache",
            "D": "磁盘"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 96
    },
    {
        "question": "在系统内存中设置磁盘缓冲区的主要目的是( )。",
        "options": {
            "A": "减少磁盘I/O次数",
            "B": "减少平均寻道时间",
            "C": "提高磁盘数据可靠性",
            "D": "实现设备无关性"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 97
    },
    {
        "question": "下列选项中，不能改善磁盘设备I/O性能的是( )。",
        "options": {
            "A": "重排I/O请求次序",
            "B": "在一个磁盘上设置多个分区",
            "C": "预读和滞后写",
            "D": "优化文件物理块的分布"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 98
    },
    {
        "question": "下列优化方法中，可以提高文件访问速度的是( )。 Ⅰ.提前读 Ⅱ.为文件分配连续的簇 Ⅲ.延迟写 Ⅳ.采用磁盘高速缓存",
        "options": {
            "A": "仅Ⅰ、Ⅱ",
            "B": "仅Ⅱ、Ⅲ",
            "C": "仅Ⅰ、Ⅲ、Ⅳ",
            "D": "Ⅰ、Ⅱ、Ⅲ、Ⅳ"
        },
        "answer": [
            "D"
        ],
        "type": "single",
        "source": "",
        "id": 99
    },
    {
        "question": "对于以扇区(512字节)作为基本分配单位的FAT12文件系统(文件分配表的表项为12位)，其所支持的磁盘分区容量为( )字节。",
        "options": {
            "A": "256K",
            "B": "4M",
            "C": "2M",
            "D": "8M"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 100
    },
    {
        "question": "操作系统的四大目标是方便性、有效性、可扩充性和______。",
        "options": null,
        "answer": [
            "开放性"
        ],
        "type": "fill",
        "source": "",
        "id": 101
    },
    {
        "question": "用户通过______和图形界面与操作系统交互。",
        "options": null,
        "answer": [
            "命令行",
            "终端",
            "命令行界面"
        ],
        "type": "fill",
        "source": "",
        "id": 102
    },
    {
        "question": "实时系统必须保证对外部事件的______响应。",
        "options": null,
        "answer": [
            "及时",
            "实时"
        ],
        "type": "fill",
        "source": "",
        "id": 103
    },
    {
        "question": "内核的两种功能是支撑功能和______。",
        "options": null,
        "answer": [
            "资源管理功能"
        ],
        "type": "fill",
        "source": "",
        "id": 104
    },
    {
        "question": "中断是操作系统内核夺回CPU使用权的______途径。",
        "options": null,
        "answer": [
            "唯一"
        ],
        "type": "fill",
        "source": "",
        "id": 105
    },
    {
        "question": "分层操作系统中，调试需按______顺序逐层进行。",
        "options": null,
        "answer": [
            "自底向上"
        ],
        "type": "fill",
        "source": "",
        "id": 106
    },
    {
        "question": "现代操作系统的接口包括______和______。",
        "options": null,
        "answer": [
            "用户接口",
            "程序接口"
        ],
        "type": "fill",
        "source": "",
        "id": 107
    },
    {
        "question": "逻辑地址到物理地址的转换由______完成。",
        "options": null,
        "answer": [
            "存储器管理模块"
        ],
        "type": "fill",
        "source": "",
        "id": 108
    },
    {
        "question": "文件读写操作通过______请求操作系统服务。",
        "options": null,
        "answer": [
            "系统调用"
        ],
        "type": "fill",
        "source": "",
        "id": 109
    },
    {
        "question": "在操作系统中， ______ 是指多个进程共享某些资源的特征。这一特征可能导致 ______ 或死锁问题。",
        "options": null,
        "answer": [
            "共享;资源共享",
            "竞争条件"
        ],
        "type": "fill",
        "source": "",
        "id": 110
    },
    {
        "question": "进程的五大基本特征分别是动态性、______、并发性、异步性和结构性。",
        "options": null,
        "answer": [
            "独立性"
        ],
        "type": "fill",
        "source": "",
        "id": 111
    },
    {
        "question": "进程的阻塞状态通常是由 ______ 引起的，而在事件完成后，操作系统会将进程 ______ 并加入就绪队列。",
        "options": null,
        "answer": [
            "等待事件",
            "唤醒"
        ],
        "type": "fill",
        "source": "",
        "id": 112
    },
    {
        "question": "共享存储通信中，多个进程访问共享区时必须通过______机制避免冲突。",
        "options": null,
        "answer": [
            "同步互斥"
        ],
        "type": "fill",
        "source": "",
        "id": 113
    },
    {
        "question": "线程可理解为______级进程，共享进程资源但独立调度。",
        "options": null,
        "answer": [
            "轻量"
        ],
        "type": "fill",
        "source": "",
        "id": 114
    },
    {
        "question": "多对一线程模型中，多个用户线程映射到______个内核线程。",
        "options": null,
        "answer": [
            "一"
        ],
        "type": "fill",
        "source": "",
        "id": 115
    },
    {
        "question": "多对多模型允许用户线程______绑定到多个内核线程执行。",
        "options": null,
        "answer": [
            "动态"
        ],
        "type": "fill",
        "source": "",
        "id": 116
    },
    {
        "question": "线程拥有 ______、 ______ 和 ______ 等基本属性。",
        "options": null,
        "answer": [
            "执行状态",
            "优先级",
            "私有堆栈"
        ],
        "type": "fill",
        "source": "",
        "id": 117
    },
    {
        "question": "进程状态的变化包括：就绪态→______态，运行态→______态，运行态→______态。",
        "options": null,
        "answer": [
            "运行",
            "就绪",
            "阻塞"
        ],
        "type": "fill",
        "source": "",
        "id": 118
    },
    {
        "question": "进程状态转换图中，从运行态可以直接转换为 ______ 态或 ______ 态。",
        "options": null,
        "answer": [
            "阻塞",
            "就绪"
        ],
        "type": "fill",
        "source": "",
        "id": 119
    },
    {
        "question": "消息传递中，______原语用于发送格式化的消息。",
        "options": null,
        "answer": [
            "Send",
            "发送"
        ],
        "type": "fill",
        "source": "",
        "id": 120
    },
    {
        "question": "在死锁的四个必要条件中，如果系统允许资源在运行过程中被剥夺，则破坏了 ______ 条件。",
        "options": null,
        "answer": [
            "不可抢占"
        ],
        "type": "fill",
        "source": "",
        "id": 121
    },
    {
        "question": "在基于公平原则的调度算法中，每个进程获得 ______ 的CPU时间。",
        "options": null,
        "answer": [
            "相同"
        ],
        "type": "fill",
        "source": "",
        "id": 122
    },
    {
        "question": "如果资源分配图中出现 ______ ，则可能存在死锁。",
        "options": null,
        "answer": [
            "循环"
        ],
        "type": "fill",
        "source": "",
        "id": 123
    },
    {
        "question": "资源分配图中，一个节点代表一个______，一条分配边表示某个资源分配给了某个节点。",
        "options": null,
        "answer": [
            "进程"
        ],
        "type": "fill",
        "source": "",
        "id": 124
    },
    {
        "question": "在死锁预防中，破坏“不可抢占”条件的方法是允许系统在运行时______资源，而不是必须等到进程主动______资源。",
        "options": null,
        "answer": [
            "回收",
            "释放"
        ],
        "type": "fill",
        "source": "",
        "id": 125
    },
    {
        "question": "为了破坏“请求和保持”条件，操作系统可以采用______分配策略，即要求进程在开始运行前申请其所需的所有资源。",
        "options": null,
        "answer": [
            "一次性"
        ],
        "type": "fill",
        "source": "",
        "id": 126
    },
    {
        "question": "破坏“不可抢占”条件的典型策略是允许操作系统在特定条件下______资源，而非让其一直被进程占用。这通常用于处理______状态下的进程。",
        "options": null,
        "answer": [
            "回收",
            "死锁"
        ],
        "type": "fill",
        "source": "",
        "id": 127
    },
    {
        "question": "在先来先服务算法中，进程的调度顺序取决于其______，而与______无关。",
        "options": null,
        "answer": [
            "到达时间",
            "运行时间"
        ],
        "type": "fill",
        "source": "",
        "id": 128
    },
    {
        "question": "轮转调度算法通过为每个进程分配一个______，使得每个进程都能获得______的执行机会。",
        "options": null,
        "answer": [
            "时间片",
            "公平"
        ],
        "type": "fill",
        "source": "",
        "id": 129
    },
    {
        "question": "在优先级调度算法中，进程的调度依据是其______，而非______。",
        "options": null,
        "answer": [
            "优先级",
            "到达时间"
        ],
        "type": "fill",
        "source": "",
        "id": 130
    },
    {
        "question": "多道批处理系统通过______技术提高CPU利用率。",
        "options": null,
        "answer": [
            "多道程序设计"
        ],
        "type": "fill",
        "source": "",
        "id": 131
    },
    {
        "question": "操作系统隐藏硬件复杂性的技术称为______。",
        "options": null,
        "answer": [
            "抽象"
        ],
        "type": "fill",
        "source": "",
        "id": 132
    },
    {
        "question": "操作系统的并发性是指多个事件在______内交替执行。",
        "options": null,
        "answer": [
            "同一时间段"
        ],
        "type": "fill",
        "source": "",
        "id": 133
    },
    {
        "question": "处理机从用户态切换到内核态的标志是执行______。",
        "options": null,
        "answer": [
            "系统调用"
        ],
        "type": "fill",
        "source": "",
        "id": 134
    },
    {
        "question": "分时系统的时间片轮转调度保证了______性。",
        "options": null,
        "answer": [
            "公平"
        ],
        "type": "fill",
        "source": "",
        "id": 135
    },
    {
        "question": "程序顺序执行时的三个特征:______、______、______。",
        "options": null,
        "answer": [
            "顺序性",
            "封闭性",
            "可再现性"
        ],
        "type": "fill",
        "source": "",
        "id": 136
    },
    {
        "question": "创建进程时，操作系统首先为其分配______结构并初始化。",
        "options": null,
        "answer": [
            "PCB"
        ],
        "type": "fill",
        "source": "",
        "id": 137
    },
    {
        "question": "进程的______指各进程相互隔离，一个进程的错误不会直接影响其他进程。",
        "options": null,
        "answer": [
            "独立性"
        ],
        "type": "fill",
        "source": "",
        "id": 138
    },
    {
        "question": "线程切换时，仅需保存______上下文，开销远小于进程切换。",
        "options": null,
        "answer": [
            "少量"
        ],
        "type": "fill",
        "source": "",
        "id": 139
    },
    {
        "question": "前趋图不能包含______，否则无法确定执行顺序。",
        "options": null,
        "answer": [
            "循环"
        ],
        "type": "fill",
        "source": "",
        "id": 140
    },
    {
        "question": "虚拟存储器的基本特征是______、______和______，因而决定了实现虚拟存储器的关键技术是______和______置换。",
        "options": null,
        "answer": [
            "多次性",
            "对换性",
            "虚拟性",
            "请求调页(段)",
            "页(段)"
        ],
        "type": "fill",
        "source": "",
        "id": 141
    },
    {
        "question": "实现页式虚拟存储器，除了需要有一定容量的内存和相当容量的______外，还需要有______、______和______的硬件支持。",
        "options": null,
        "answer": [
            "外存",
            "页表机制",
            "地址变换机构",
            "缺页中断机构"
        ],
        "type": "fill",
        "source": "",
        "id": 142
    },
    {
        "question": "I/O系统的上接口是______接口，下接口是______接口。",
        "options": null,
        "answer": [
            "I/O系统",
            "软件/硬件"
        ],
        "type": "fill",
        "source": "",
        "id": 143
    },
    {
        "question": "设备与控制器之间的接口中有三类信号，各对应一条______。",
        "options": null,
        "answer": [
            "信号线"
        ],
        "type": "fill",
        "source": "",
        "id": 144
    },
    {
        "question": "一个设备控制器可以连接______个设备。",
        "options": null,
        "answer": [
            "一或多",
            "多"
        ],
        "type": "fill",
        "source": "",
        "id": 145
    },
    {
        "question": "中断向量表存放每个设备的______的入口地址。",
        "options": null,
        "answer": [
            "中断处理程序"
        ],
        "type": "fill",
        "source": "",
        "id": 146
    },
    {
        "question": "系统为每个中断源规定不同的______。",
        "options": null,
        "answer": [
            "优先级"
        ],
        "type": "fill",
        "source": "",
        "id": 147
    },
    {
        "question": "设备驱动程序需要支持______，即多个进程可以同时调用它。",
        "options": null,
        "answer": [
            "可重入"
        ],
        "type": "fill",
        "source": "",
        "id": 148
    },
    {
        "question": "逻辑设备表(LUT)用于将______映射为物理设备名。",
        "options": null,
        "answer": [
            "逻辑设备名"
        ],
        "type": "fill",
        "source": "",
        "id": 149
    },
    {
        "question": "设备分配的三种策略是:独占设备、共享设备和______。",
        "options": null,
        "answer": [
            "虚拟设备"
        ],
        "type": "fill",
        "source": "",
        "id": 150
    },
    {
        "question": "假脱机打印系统中，磁盘缓冲区用于暂存______。",
        "options": null,
        "answer": [
            "用户程序的输出数据"
        ],
        "type": "fill",
        "source": "",
        "id": 151
    },
    {
        "question": "缓冲池的工作方式包括收容输入、提取输入、收容输出和______。",
        "options": null,
        "answer": [
            "提取输出"
        ],
        "type": "fill",
        "source": "",
        "id": 152
    },
    {
        "question": "磁盘的基本组成单位包括盘面、磁道和______。",
        "options": null,
        "answer": [
            "扇区"
        ],
        "type": "fill",
        "source": "",
        "id": 153
    },
    {
        "question": "SCAN算法也被称为______算法。",
        "options": null,
        "answer": [
            "电梯调度"
        ],
        "type": "fill",
        "source": "",
        "id": 154
    },
    {
        "question": "为实现CPU与外部设备的并行工作，______是系统必须引入的一种机制。",
        "options": null,
        "answer": [
            "中断机制"
        ],
        "type": "fill",
        "source": "",
        "id": 155
    },
    {
        "question": "文件系统模型中，最底层是______层，负责设备驱动程序。",
        "options": null,
        "answer": [
            "I/O控制"
        ],
        "type": "fill",
        "source": "",
        "id": 156
    },
    {
        "question": "顺序文件的两种排列方式是______和顺序结构。",
        "options": null,
        "answer": [
            "串结构"
        ],
        "type": "fill",
        "source": "",
        "id": 157
    },
    {
        "question": "文件目录是______的集合。",
        "options": null,
        "answer": [
            "文件控制块"
        ],
        "type": "fill",
        "source": "",
        "id": 158
    },
    {
        "question": "影响文件安全性的主要因素有人为因素、系统因素和______。",
        "options": null,
        "answer": [
            "自然因素"
        ],
        "type": "fill",
        "source": "",
        "id": 159
    }
]
  },
  db: {
    name: "数据库",
    questions: [
    {
        "question": "从数据库管理系统角度来看，数据库系统可分为______、______和______三级。",
        "options": null,
        "answer": [
            "外模式",
            "模式",
            "内模式"
        ],
        "type": "fill",
        "source": "",
        "id": 1
    },
    {
        "question": "数据库系统一般包括数据库、______、应用程序、数据库管理员与用户。",
        "options": null,
        "answer": [
            "数据库管理系统"
        ],
        "type": "fill",
        "source": "",
        "id": 2
    },
    {
        "question": "数据库系统的逻辑模型，按照计算机的观点对数据建模，主要包括______模型、______模型、______模型、面向对象模型、对象关系模型和半结构化数据模型等。",
        "options": null,
        "answer": [
            "层次",
            "网状",
            "关系"
        ],
        "type": "fill",
        "source": "",
        "id": 3
    },
    {
        "question": "关系代数的运算可以分为______和______两类。",
        "options": null,
        "answer": [
            "传统的集合运算",
            "专门的关系运算"
        ],
        "type": "fill",
        "source": "",
        "id": 4
    },
    {
        "question": "关系模型包括8种查询操作，其中______、______、______、______和笛卡儿积是5种基本操作，其他操作可以用基本操作定义和导出。",
        "options": null,
        "answer": [
            "选择",
            "投影",
            "并",
            "差"
        ],
        "type": "fill",
        "source": "",
        "id": 5
    },
    {
        "question": "在SQL中，模式对应的是______，内模式对应的是______，外模式对应的是______和部分基本表。",
        "options": null,
        "answer": [
            "基本表",
            "存储文件",
            "视图"
        ],
        "type": "fill",
        "source": "",
        "id": 6
    },
    {
        "question": "数据独立性是数据库领域的重要概念，包括数据的物理独立性和数据的______独立性。",
        "options": null,
        "answer": [
            "逻辑"
        ],
        "type": "fill",
        "source": "",
        "id": 7
    },
    {
        "question": "在SQL语言中，使用______语句进行授权，使用______语句收回授权。",
        "options": null,
        "answer": [
            "Grant",
            "Revoke"
        ],
        "type": "fill",
        "source": "",
        "id": 8
    },
    {
        "question": "在SQLyog中，若需要查看某张表的所有数据，可在对象浏览器中右键点击该表，选择______选项。",
        "options": null,
        "answer": [
            "打开表"
        ],
        "type": "fill",
        "source": "",
        "id": 9
    },
    {
        "question": "在SQLyog中，若需要创建数据库，可在对象浏览器中右键，选择______选项。",
        "options": null,
        "answer": [
            "创建数据库"
        ],
        "type": "fill",
        "source": "",
        "id": 10
    },
    {
        "question": "在关系模型中，关系操作包括______、______、______和______等。",
        "options": null,
        "answer": [
            "查询",
            "插入",
            "修改",
            "删除"
        ],
        "type": "fill",
        "source": "",
        "id": 11
    },
    {
        "question": "SQL语言集数据______语言、______语言、______语言的功能于一体。",
        "options": null,
        "answer": [
            "定义",
            "数据操纵",
            "数据控制"
        ],
        "type": "fill",
        "source": "",
        "id": 12
    },
    {
        "question": "关系模式的规范化过程是通过对关系模式进行______来实现的。",
        "options": null,
        "answer": [
            "模式分解"
        ],
        "type": "fill",
        "source": "",
        "id": 13
    },
    {
        "question": "一个低一级范式的关系模式通过______可以转换为若干个更高级别范式的关系模式的集合，这种过程就叫规范化。",
        "options": null,
        "answer": [
            "模式分解"
        ],
        "type": "fill",
        "source": "",
        "id": 14
    },
    {
        "question": "______是一种监视措施，跟踪有关数据的相关操作，并可用于进行数据库安全性防范。",
        "options": null,
        "answer": [
            "审计"
        ],
        "type": "fill",
        "source": "",
        "id": 15
    },
    {
        "question": "从关系规范化理论的角度讲，一个只满足1NF的关系可能存在的四方面问题是：数据冗余度大、插入异常、______和______。",
        "options": null,
        "answer": [
            "更新异常",
            "删除异常"
        ],
        "type": "fill",
        "source": "",
        "id": 16
    },
    {
        "question": "如果一个关系数据库中的所有关系模式都属于______，那么在函数依赖范畴内，它已实现了模式的彻底分解，达到了最高的规范化程度。",
        "options": null,
        "answer": [
            "BCNF"
        ],
        "type": "fill",
        "source": "",
        "id": 17
    },
    {
        "question": "在SQL中，使用______关键字可以为完整性约束命名，便于后续修改或删除。",
        "options": null,
        "answer": [
            "CONSTRAINT"
        ],
        "type": "fill",
        "source": "",
        "id": 18
    },
    {
        "question": "用户定义的完整性分为属性上的约束和______上的约束。",
        "options": null,
        "answer": [
            "元组"
        ],
        "type": "fill",
        "source": "",
        "id": 19
    },
    {
        "question": "数据模型通常由______、数据操作和______三部分组成。",
        "options": null,
        "answer": [
            "数据结构",
            "完整性约束"
        ],
        "type": "fill",
        "source": "",
        "id": 20
    },
    {
        "question": "关系R的属性A参照引用关系T的属性A，T的某条元组对应的A属性值在R中出现，当要删除T的这条元组时，系统可以采用的策略包括拒绝执行、______、设为空值。",
        "options": null,
        "answer": [
            "级联删除"
        ],
        "type": "fill",
        "source": "",
        "id": 21
    },
    {
        "question": "关系R的属性A参照引用关系T的属性A，T的某条元组对应的A属性值在R中出现，当要删除T的这条元组时，系统可以采用的策略包括______、级联删除、______。",
        "options": null,
        "answer": [
            "拒绝执行",
            "设为空值"
        ],
        "type": "fill",
        "source": "",
        "id": 22
    },
    {
        "question": "在CREATE TABLE时，用户定义的完整性可以通过______、______、______等子句实现。",
        "options": null,
        "answer": [
            "NOT NULL",
            "UNIQUE",
            "CHECK"
        ],
        "type": "fill",
        "source": "",
        "id": 23
    },
    {
        "question": "数据库设计六个阶段依次是：需求分析、______、______、______、数据库实施、数据库运行和维护。",
        "options": null,
        "answer": [
            "概念结构设计",
            "逻辑结构设计",
            "物理结构设计"
        ],
        "type": "fill",
        "source": "",
        "id": 24
    },
    {
        "question": "将E-R图转换为关系模型时，一个实体型转换为一个______。",
        "options": null,
        "answer": [
            "关系模式"
        ],
        "type": "fill",
        "source": "",
        "id": 25
    },
    {
        "question": "在数据库设计中，______是系统中各类数据描述的集合。",
        "options": null,
        "answer": [
            "数据字典"
        ],
        "type": "fill",
        "source": "",
        "id": 26
    },
    {
        "question": "HBase是一个______、多维度、排序的映射表，原生索引是行键，数据存储维度有列族、列限定符和时间戳等。",
        "options": null,
        "answer": [
            "稀疏"
        ],
        "type": "fill",
        "source": "",
        "id": 27
    },
    {
        "question": "数据仓库是一个面向主题的、集成的、相对稳定的（不可更新的）、______的数据集合。",
        "options": null,
        "answer": [
            "历史变化"
        ],
        "type": "fill",
        "source": "",
        "id": 28
    },
    {
        "question": "大数据存储技术利用分布式文件系统、数据仓库、关系数据库、NoSQL数据库、云数据库等，实现对结构化、______和______海量数据的存储和管理。",
        "options": null,
        "answer": [
            "半结构化",
            "非结构化"
        ],
        "type": "fill",
        "source": "",
        "id": 29
    },
    {
        "question": "典型的NoSQL数据库通常包括______、______、文档数据库和图数据库。",
        "options": null,
        "answer": [
            "键值数据库",
            "列族数据库"
        ],
        "type": "fill",
        "source": "",
        "id": 30
    },
    {
        "question": "（ ）是长期储存在计算机内、有组织的、可共享的大量数据的集合。",
        "options": {
            "A": "文件组织",
            "B": "数据库",
            "C": "数据",
            "D": "数据库管理系统"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 31
    },
    {
        "question": "在数据管理技术的发展过程中，经历了人工管理阶段、文件系统阶段和数据库系统阶段。在这几个阶段中，数据独立性最高的是（ ）阶段。",
        "options": {
            "A": "数据库系统",
            "B": "文件系统",
            "C": "人工管理",
            "D": "数据项管理"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 32
    },
    {
        "question": "关系数据模型的三要素是（ ）。",
        "options": {
            "A": "关系数据结构、关系操作集合和关系规范化理论",
            "B": "关系数据结构、关系规范理论和关系完整性约束",
            "C": "关系规范理论、关系操作集合和关系完整性约束",
            "D": "关系数据结构、关系操作集合和关系完整性约束"
        },
        "answer": [
            "D"
        ],
        "type": "single",
        "source": "",
        "id": 33
    },
    {
        "question": "假定学生关系是Student(Sno, Sname, Smajor)，课程关系是Course(Cno, Cname, Ccredit)，学生选课关系是SC(Sno, Cno, Grade)。要查找某个学生的姓名及其选课的平均成绩，将会使用到的关系有（ ）。",
        "options": {
            "A": "Student、Course",
            "B": "SC、Course",
            "C": "Student",
            "D": "Student、SC"
        },
        "answer": [
            "D"
        ],
        "type": "single",
        "source": "",
        "id": 34
    },
    {
        "question": "假定学生关系是Student(Sno, Sname, Smajor)，课程关系是Course(Cno, Cname, Ccredit)，学生选课关系是SC(Sno, Cno, Grade)。要查找某个学生的姓名及其所选课程的名字，将会使用到的关系有（ ）。",
        "options": {
            "A": "Student、Course、SC",
            "B": "SC、Course",
            "C": "Student、Course",
            "D": "Student、SC"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 35
    },
    {
        "question": "关系操作中，操作的对象和结果都是（ ）。",
        "options": {
            "A": "记录",
            "B": "元组",
            "C": "集合",
            "D": "属性"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 36
    },
    {
        "question": "审计属于数据库管理系统安全性控制中的（ ）。",
        "options": {
            "A": "事前控制",
            "B": "事中控制",
            "C": "事后控制",
            "D": "存储保护"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 37
    },
    {
        "question": "外模式/模式映像保证了数据与程序之间的（ ）。",
        "options": {
            "A": "逻辑独立性",
            "B": "物理独立性",
            "C": "实体完整性",
            "D": "参照完整性"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 38
    },
    {
        "question": "对数据库安全性产生威胁的因素不包括（ ）。",
        "options": {
            "A": "非授权用户对数据库的恶意存取和破坏",
            "B": "数据的不相容性",
            "C": "数据库中重要或敏感的数据被泄露",
            "D": "安全环境的脆弱性"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 39
    },
    {
        "question": "将用户Wang对Student表的修改学生学号的权限收回，正确的语句是（ ）。",
        "options": {
            "A": "REVOKE UPDATE(Sno) TO TABLE Student FROM Wang",
            "B": "REVOKE UPDATE(Sno) TO Student FROM Wang",
            "C": "REVOKE UPDATE(Sno) ON TABLE Student FROM Wang",
            "D": "REVOKE UPDATE(Sno) ON Student FROM Wang"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 40
    },
    {
        "question": "把查询Student表和修改学生学号的权限授予给用户Wang，正确的语句是（ ）。",
        "options": {
            "A": "GRANT UPDATE(Sno), SELECT TO TABLE Student ON Wang",
            "B": "GRANT UPDATE(Sno), SELECT TO Student ON Wang",
            "C": "GRANT UPDATE(Sno), SELECT ON TABLE Student TO Wang",
            "D": "GRANT UPDATE(Sno), SELECT ON Student TO Wang"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 41
    },
    {
        "question": "对数据库安全性产生威胁的因素不包括（ ）。",
        "options": {
            "A": "非授权用户对数据库的恶意存取和破坏",
            "B": "数据内容不正确",
            "C": "数据库中重要或敏感的数据被泄露",
            "D": "安全环境的脆弱性"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 42
    },
    {
        "question": "用户身份鉴别属于数据库管理系统安全性控制中的（ ）。",
        "options": {
            "A": "事前控制",
            "B": "事中控制",
            "C": "事后控制",
            "D": "存储保护"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 43
    },
    {
        "question": "参照完整性违约处理策略中，默认采用的策略是？（ ）",
        "options": {
            "A": "级联操作",
            "B": "设置为空值",
            "C": "拒绝执行",
            "D": "记录日志"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 44
    },
    {
        "question": "在关系模式中，若X→Y，且Y⊈X，则称X→Y为？（ ）",
        "options": {
            "A": "平凡函数依赖",
            "B": "非平凡函数依赖",
            "C": "完全函数依赖",
            "D": "部分函数依赖"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 45
    },
    {
        "question": "在数据库设计过程中，下列哪个阶段与具体的数据库管理系统无关？（ ）",
        "options": {
            "A": "物理结构设计",
            "B": "逻辑结构设计",
            "C": "概念结构设计",
            "D": "数据库实施"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 46
    },
    {
        "question": "数据库系统的核心是（ ）。",
        "options": {
            "A": "数据库管理员",
            "B": "数据库管理系统",
            "C": "应用程序",
            "D": "数据库"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 47
    },
    {
        "question": "长期存储在计算机内，有组织的、可共享的大量数据的集合是（ ）。",
        "options": {
            "A": "数据（Data）",
            "B": "数据库（DataBase）",
            "C": "数据库管理系统（DBMS）",
            "D": "数据库系统（DBS）"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 48
    },
    {
        "question": "关系运算中花费时间可能最长的运算是（ ）。",
        "options": {
            "A": "投影",
            "B": "选择",
            "C": "笛卡尔积",
            "D": "除"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 49
    },
    {
        "question": "下列说法正确的是（ ）。",
        "options": {
            "A": "候选码都可以唯一地标识一个元组",
            "B": "候选码中只能包含一个属性",
            "C": "主属性可以取空值",
            "D": "关系的外码不可以取空值"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 50
    },
    {
        "question": "在数据库中存储的是（ ）。",
        "options": {
            "A": "数据",
            "B": "数据模型",
            "C": "数据以及数据之间的联系",
            "D": "信息"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 51
    },
    {
        "question": "在SQLyog中，要备份整个数据库，正确的操作路径是（ ）。",
        "options": {
            "A": "右击数据库→导入→导入外部数据",
            "B": "右击数据库→备份/导出→转储到SQL",
            "C": "右击数据库→编辑→导出",
            "D": "右击数据库→属性→备份"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 52
    },
    {
        "question": "在定义用户定义的完整性时，若要限制性别属性只能取\"男\"或\"女\"，应使用以下哪个短语？（ ）",
        "options": {
            "A": "NOT NULL",
            "B": "UNIQUE",
            "C": "CHECK",
            "D": "FOREIGN KEY"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 53
    },
    {
        "question": "如何构造出一个合适的数据逻辑结构是（ ）主要解决的问题。",
        "options": {
            "A": "关系系统查询优化",
            "B": "数据字典",
            "C": "关系数据库规范化理论",
            "D": "关系数据库查询"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 54
    },
    {
        "question": "DBMS通常提供授权功能来控制不同用户访问数据的权限，这主要是为了实现数据库的（ ）。",
        "options": {
            "A": "可靠性",
            "B": "一致性",
            "C": "完整性",
            "D": "安全性"
        },
        "answer": [
            "D"
        ],
        "type": "single",
        "source": "",
        "id": 55
    },
    {
        "question": "下列操作中，不能在SQLyog的对象浏览器中直接完成的是（ ）。",
        "options": {
            "A": "创建新数据库",
            "B": "编辑表结构",
            "C": "编写复杂存储过程",
            "D": "删除数据表"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 56
    },
    {
        "question": "在数据仓库的体系结构中，ECTL/ETL工具的主要作用是（ ）。",
        "options": {
            "A": "数据可视化",
            "B": "数据抽取、清洗、转换和加载",
            "C": "数据备份",
            "D": "数据索引构建"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 57
    },
    {
        "question": "HDFS体系结构中，负责管理文件系统命名空间的是（ ）。",
        "options": {
            "A": "DataNode（数据节点）",
            "B": "NameNode（名称节点）",
            "C": "Client（客户）",
            "D": "SecondaryNameNode（第二名称节点）"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 58
    },
    {
        "question": "HDFS中实际存储数据块的组件是？（ ）",
        "options": {
            "A": "NameNode",
            "B": "DataNode",
            "C": "Client",
            "D": "SecondaryNameNode"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 59
    },
    {
        "question": "下列哪一项不属于大数据的\"4V\"特征？（ ）",
        "options": {
            "A": "数据量大（Volume）",
            "B": "类型多样（Variety）",
            "C": "价值密度高（Value）",
            "D": "变化快（Velocity）"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 60
    },
    {
        "question": "下列哪种NoSQL数据库最适合处理图结构数据？（ ）",
        "options": {
            "A": "Redis",
            "B": "MongoDB",
            "C": "Neo4J",
            "D": "HBase"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 61
    },
    {
        "question": "在HBase中，唯一用于加速数据访问的索引是？（ ）",
        "options": {
            "A": "列索引",
            "B": "行键",
            "C": "时间戳索引",
            "D": "列族索引"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 62
    },
    {
        "question": "数据仓库主要用于支持什么类型的处理？（ ）",
        "options": {
            "A": "事务处理",
            "B": "分析处理",
            "C": "实时交易",
            "D": "数据备份"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 63
    },
    {
        "question": "数据库设计的规范化理论，关于数据冗余的说法正确的是（ ）。",
        "options": {
            "A": "允许有少量冗余",
            "B": "不允许有冗余",
            "C": "允许有大量冗余",
            "D": "以上说法都不对"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 64
    },
    {
        "question": "数据库中建立索引的目的是为了（ ）。",
        "options": {
            "A": "加快建表速度",
            "B": "加快存取速度",
            "C": "提高安全性",
            "D": "节省存储空间"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 65
    },
    {
        "question": "下面操作受限制的是（ ）。",
        "options": {
            "A": "视图定义",
            "B": "视图查询",
            "C": "视图更新",
            "D": "视图授权"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 66
    },
    {
        "question": "在数据库的安全性控制中，授权的数据对象的（ ），授权子系统就越灵活。",
        "options": {
            "A": "范围越小",
            "B": "约束越细致",
            "C": "范围越大",
            "D": "约束范围大"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 67
    },
    {
        "question": "在强制存取控制机制中，当主体的许可证级别等于客体的密级时，主体可以对客体进行的操作是（ ）",
        "options": {
            "A": "读取",
            "B": "写入",
            "C": "不可操作",
            "D": "读取、写入"
        },
        "answer": [
            "D"
        ],
        "type": "single",
        "source": "",
        "id": 68
    },
    {
        "question": "完整性控制的防范对象是（ ）。",
        "options": {
            "A": "非法用户",
            "B": "不合语义的数据",
            "C": "非法操作",
            "D": "错误的操作"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 69
    },
    {
        "question": "以下说法错误的是（ ）。",
        "options": {
            "A": "规则和默认是实施完整性控制的手段",
            "B": "完整性约束按约束对象的状态分为静态约束和动态约束",
            "C": "完整性约束可以通过DOACP五元组表示",
            "D": "函数依赖不属于完整性约束"
        },
        "answer": [
            "D"
        ],
        "type": "single",
        "source": "",
        "id": 70
    },
    {
        "question": "数据库系统包括数据库、数据库管理系统、应用系统和数据库管理员。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 71
    },
    {
        "question": "数据模型通常由数据结构、数据操纵和完整性约束三部分组成，称为数据模型的三要素。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 72
    },
    {
        "question": "SQL采用的是面向记录的操作方式，以记录为单位进行操作。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 73
    },
    {
        "question": "数据库管理系统的安全性保护措施包括事前控制、事中控制、事后控制和存储保护。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 74
    },
    {
        "question": "在强制存取控制机制中，当主体的许可证级别等于客体的密级时，主体可以对客体进行读取和写入操作。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 75
    },
    {
        "question": "需求分析阶段和概念结构设计阶段是与具体的数据库管理系统（DBMS）相关的。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 76
    },
    {
        "question": "在SQLyog中，执行INSERT/UPDATE/DELETE数据更新语句后，结果集面板会显示受影响的行数。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 77
    },
    {
        "question": "数据库安全控制的目的是防止非法对数据库的使用和对数据库的恶意破坏。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 78
    },
    {
        "question": "已知学生关系student(学号, 姓名, 系别)，如果规定学号的值域必须是7个数字组成的字符串，则这一个规则属于用户自定义完整性约束。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 79
    },
    {
        "question": "若数据库关系设计中存在函数传递依赖，可能满足2NF，但一定不满足3NF。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 80
    },
    {
        "question": "一个一对多联系可以转换为一个独立的关系模式，也可以与1端对应的关系模式合并。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 81
    },
    {
        "question": "CHECK约束只能定义在单个属性上，不能定义在多个属性之间。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 82
    },
    {
        "question": "一个关系模式中的函数依赖是指该模式所有可能的关系实例均需满足的约束条件。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 83
    },
    {
        "question": "在数据库设计中，将E-R图转换成关系数据模型的过程属于逻辑设计阶段。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 84
    },
    {
        "question": "E-R图是表示概念模型的有效工具之一，E-R图中的菱形框表示的是实体。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 85
    },
    {
        "question": "已知商品关系：商品(商品号,商品名,生产厂家)，如果规定商品号为主码，而商品名又要保证不能重复，则应设置商品名的唯一性约束。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 86
    },
    {
        "question": "在进行查询操作时，WHERE条件表达式中可以出现聚集函数。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 87
    },
    {
        "question": "数据库的外模式是面向用户的局部数据视图，可通过视图机制实现。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 88
    },
    {
        "question": "SQL是一种非过程化语言，用户只要说明需要的数据库内容，不必说明存取所需数据的具体过程和操作。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 89
    },
    {
        "question": "在SELECT语句的WHERE子句中，完全可以用IN子查询来代替OR逻辑表达式。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 90
    }
]
  },
  jsp: {
    name: "JSP/Web程序设计",
    questions: [
    {
        "question": "可以在以下哪个标记之间插入变量与方法声明?( )。",
        "options": {
            "A": "<% 和 %>",
            "B": "<% 和 />",
            "C": "<%! 和 %>",
            "D": "<% 和 !>"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 1
    },
    {
        "question": "JSP的page编译指令的属性language的默认值是( )。",
        "options": {
            "A": "JSP",
            "B": "C",
            "C": "Java",
            "D": "C++"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 2
    },
    {
        "question": "可以在以下哪个标记之间插入Java程序片?( )。",
        "options": {
            "A": "<% 和 %>",
            "B": "<% 和 />",
            "C": "</ 和 %>",
            "D": "<% 和 !>"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 3
    },
    {
        "question": "下列哪一项不属于JSP动作指令标记? ( )。",
        "options": {
            "A": "<jsp:param>",
            "B": "<jsp:forward>",
            "C": "<jsp:include>",
            "D": "<%@ include %>"
        },
        "answer": [
            "D"
        ],
        "type": "single",
        "source": "",
        "id": 4
    },
    {
        "question": "动作标记( )的作用是:从该标记出现处停止当前JSP页面的继续执行，从而转向执行动作标记中page属性值指定的JSP页面。",
        "options": {
            "A": "<jsp:param>",
            "B": "<jsp:forward>",
            "C": "<jsp:include>",
            "D": "<jsp:useBean %>"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 5
    },
    {
        "question": "include指令用于在JSP页面静态插入一个文件，插入文件可以是JSP页面、HTML网页、文本文件或一段Java代码，但必须保证插入后形成的文件是( )。",
        "options": {
            "A": "是一个完整的HTML文件",
            "B": "是一个完整的JSP文件",
            "C": "是一个完整的TXT文件",
            "D": "是一个完整的Java源文件"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 6
    },
    {
        "question": "在“<%=”和“%>”标记之间放置( )，可以直接输出其值。",
        "options": {
            "A": "变量",
            "B": "Java表达式",
            "C": "字符串",
            "D": "数字"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 7
    },
    {
        "question": "下列变量声明在( )范围内有效。",
        "options": {
            "A": "从定义开始处有效，客户之间不共享",
            "B": "在整个页面内有效，客户之间不共享",
            "C": "在整个页面内有效，被多个客户共享",
            "D": "从定义开始处有效，被多个客户共享"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 8
    },
    {
        "question": "Tomcat安装目录中的webapps文件夹的作用是什么？",
        "options": {
            "A": "存放启动与停止服务器相关的可执行文件",
            "B": "存放服务器相关的配置文件",
            "C": "存放发布的web项目",
            "D": "存放日志文件"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 9
    },
    {
        "question": "关于JavaBean的编写规则，下列说法错误的是( )",
        "options": {
            "A": "类必须提供无参数的构造方法",
            "B": "属性必须声明为public以便直接访问",
            "C": "方法名使用get或set作为前缀，后跟首字母大写的属性名",
            "D": "布尔类型的属性可以使用is代替get"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 10
    },
    {
        "question": "在JSP中使用<jsp:useBean>动作标记时，用于指定Bean实例在哪个范围内有效的属性是( )",
        "options": {
            "A": "id",
            "B": "class",
            "C": "scope",
            "D": "type"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 11
    },
    {
        "question": "关于<jsp:getProperty>标记，下列说法正确的是( )",
        "options": {
            "A": "它可以直接输出任意Java表达式的值",
            "B": "它必须与<jsp:setProperty>配对使用",
            "C": "它用于获取Bean的某个属性值并输出",
            "D": "它用于设置Bean的某个属性值"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 12
    },
    {
        "question": "下列哪个JSP动作标记用于在页面中创建或查找一个JavaBean实例?( )",
        "options": {
            "A": "<jsp:include>",
            "B": "<jsp:forward>",
            "C": "<jsp:useBean>",
            "D": "<jsp:param>"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 13
    },
    {
        "question": "以下哪个不是JSP动作标记?( )",
        "options": {
            "A": "<jsp:useBean>",
            "B": "<jsp:setProperty>",
            "C": "<jsp:scriptlet>",
            "D": "<jsp:getProperty>"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 14
    },
    {
        "question": "如果一个Bean的作用域设置为session，则该Bean实例在以下哪种情况下会被销毁?( )",
        "options": {
            "A": "用户关闭浏览器",
            "B": "用户刷新页面",
            "C": "服务器重启",
            "D": "超过session超时时间或调用invalidate( )"
        },
        "answer": [
            "D"
        ],
        "type": "single",
        "source": "",
        "id": 15
    },
    {
        "question": "在JSP页面中使用<jsp:setProperty>标记时，若要将请求参数userName的值设置给Bean的name属性，正确的写法是( )",
        "options": {
            "A": "<jsp:setProperty name=\"bean\" property=\"name\" value=\"userName\"/>",
            "B": "<jsp:setProperty name=\"bean\" property=\"name\" param=\"userName\"/>",
            "C": "<jsp:setProperty name=\"bean\" property=\"userName\" value=\"name\"/>",
            "D": "<jsp:setProperty name=\"bean\" property=\"*\"/>"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 16
    },
    {
        "question": "Spring MVC的核心前端控制器是？",
        "options": {
            "A": "DispatcherServlet",
            "B": "HandlerMapping",
            "C": "Controller",
            "D": "ViewResolver"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 17
    },
    {
        "question": "MyBatis-Plus的核心功能不包括以下哪项？",
        "options": {
            "A": "通用CRUD接口",
            "B": "代码生成器",
            "C": "手动编写所有SQL语句",
            "D": "条件构造器"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 18
    },
    {
        "question": "Spring Boot的核心设计思想是？",
        "options": {
            "A": "约定大于配置",
            "B": "配置大于约定",
            "C": "代码生成优先",
            "D": "手动配置优先"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 19
    },
    {
        "question": "MyBatis中用于实现动态SQL条件判断的标签是？",
        "options": {
            "A": "<if>",
            "B": "<select>",
            "C": "<resultMap>",
            "D": "<insert>"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 20
    },
    {
        "question": "Spring Boot起步依赖的主要作用是？",
        "options": {
            "A": "增加项目的复杂度",
            "B": "简化Maven依赖管理",
            "C": "替代Spring框架",
            "D": "仅用于前端开发"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 21
    },
    {
        "question": "MyBatis的核心思想是将SQL从Java代码中分离，通过XML或注解管理，其主要目的是？",
        "options": {
            "A": "提高Java代码的执行效率",
            "B": "解耦SQL与业务逻辑",
            "C": "增加代码的复杂度",
            "D": "减少数据库连接次数"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 22
    },
    {
        "question": "Spring MVC中，用于将请求参数绑定到方法参数的注解是？",
        "options": {
            "A": "@RequestMapping",
            "B": "@RequestParam",
            "C": "@ResponseBody",
            "D": "@Controller"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 23
    },
    {
        "question": "Spring Boot自动配置的实现基础是？",
        "options": {
            "A": "条件注解",
            "B": "XML配置",
            "C": "手动编写配置类",
            "D": "静态资源文件"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 24
    },
    {
        "question": "在MyBatis核心工作流程中，创建SqlSession的工厂类是？",
        "options": {
            "A": "SqlSession",
            "B": "SqlSessionFactory",
            "C": "MapperProxy",
            "D": "ResultSet"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 25
    },
    {
        "question": "JSP表达式的语法格式是（）",
        "options": {
            "A": "<%表达式%>",
            "B": "<%=表达式%>",
            "C": "<%!表达式%>",
            "D": "<%@表达式%>"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 26
    },
    {
        "question": "用于在JSP中声明成员变量和方法的语法是（）",
        "options": {
            "A": "<% Java代码%>",
            "B": "<%! Java声明%>",
            "C": "<%= Java表达式%>",
            "D": "<%--注释--%>"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 27
    },
    {
        "question": "下列指令中，用于导入Java包的是（）",
        "options": {
            "A": "page指令",
            "B": "include指令",
            "C": "forward指令",
            "D": "param指令"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 28
    },
    {
        "question": "<%@ include file=\"header.jsp\" %>是（）",
        "options": {
            "A": "动态包含",
            "B": "静态包含",
            "C": "请求转发",
            "D": "参数传递"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 29
    },
    {
        "question": "获取表单单行文本框数据，应使用request对象的（）方法",
        "options": {
            "A": "getAttribute()",
            "B": "getParameter()",
            "C": "getParameterValues()",
            "D": "setAttribute()"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 30
    },
    {
        "question": "解决POST提交中文乱码，应在JSP页面开头设置（）",
        "options": {
            "A": "request.setCharacterEncoding(\"UTF-8\")",
            "B": "response.setCharacterEncoding(\"UTF-8\")",
            "C": "session.setEncoding(\"UTF-8\")",
            "D": "pageEncoding=\"UTF-8\""
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 31
    },
    {
        "question": "下列关于<jsp:forward>说法正确的是（）",
        "options": {
            "A": "地址栏会改变",
            "B": "属于客户端跳转",
            "C": "可通过request传递数据",
            "D": "会发起两次请求"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 32
    },
    {
        "question": "用于保存一次会话数据的内置对象是（）",
        "options": {
            "A": "request",
            "B": "session",
            "C": "application",
            "D": "pageContext"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 33
    },
    {
        "question": "所有用户共享、服务器关闭才销毁的对象是（）",
        "options": {
            "A": "request",
            "B": "session",
            "C": "application",
            "D": "page"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 34
    },
    {
        "question": "JSP页面域（当前页面有效）对应的对象是（）",
        "options": {
            "A": "pageContext",
            "B": "request",
            "C": "session",
            "D": "application"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 35
    },
    {
        "question": "Servlet的本质是什么？",
        "options": {
            "A": "运行在客户端的Java程序",
            "B": "运行在服务器端的Java程序",
            "C": "HTML页面的扩展",
            "D": "数据库连接工具"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 36
    },
    {
        "question": "Filter的doFilter()方法的作用是什么？",
        "options": {
            "A": "初始化过滤器",
            "B": "执行过滤逻辑",
            "C": "销毁过滤器",
            "D": "获取过滤器配置"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 37
    },
    {
        "question": "JavaBean组件在JSP开发中的主要作用是什么？",
        "options": {
            "A": "替代HTML代码实现页面布局",
            "B": "封装业务逻辑，实现代码重用",
            "C": "直接处理HTTP请求与响应",
            "D": "存储用户会话信息"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 38
    },
    {
        "question": "在JSP开发的初级阶段，将大量Java代码嵌入JSP页面会导致什么问题？",
        "options": {
            "A": "提高代码的可重用性",
            "B": "便于页面编程人员与Java程序员协作",
            "C": "降低HTML与Java代码的耦合度",
            "D": "增加修改和维护的难度"
        },
        "answer": [
            "D"
        ],
        "type": "single",
        "source": "",
        "id": 39
    },
    {
        "question": "过滤器（Filter）的作用是什么？",
        "options": {
            "A": "仅过滤客户端的HTTP请求",
            "B": "仅过滤服务器的HTTP响应",
            "C": "既过滤请求也过滤响应",
            "D": "替代Servlet处理请求"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 40
    },
    {
        "question": "JSP Model1架构在大型项目中的主要问题是什么？",
        "options": {
            "A": "JavaBean无法封装业务逻辑",
            "B": "JSP页面仍需嵌入大量流程控制代码",
            "C": "无法实现代码重用",
            "D": "不支持数据库操作"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 41
    },
    {
        "question": "以下哪个对象的作用域是整个Web应用？",
        "options": {
            "A": "request",
            "B": "session",
            "C": "application",
            "D": "page"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 42
    },
    {
        "question": "以下哪个方法用于向session对象中保存数据？",
        "options": {
            "A": "getAttribute(String key)",
            "B": "setAttribute(String key, Object obj)",
            "C": "removeAttribute(String key)",
            "D": "getId()"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 43
    },
    {
        "question": "Web服务器如何区分不同用户的session对象？",
        "options": {
            "A": "用户IP地址",
            "B": "session ID",
            "C": "浏览器类型",
            "D": "请求URL"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 44
    },
    {
        "question": "以下哪项不是JavaBean的特点？",
        "options": {
            "A": "必须具有无参构造函数",
            "B": "属性必须私有化",
            "C": "通过public的get/set方法暴露属性",
            "D": "必须继承HttpServlet类"
        },
        "answer": [
            "D"
        ],
        "type": "single",
        "source": "",
        "id": 45
    },
    {
        "question": "session对象的生命周期从何时开始？",
        "options": {
            "A": "浏览器打开时",
            "B": "客户端连接到Web应用程序时",
            "C": "服务器启动时",
            "D": "调用session.setAttribute()方法时"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 46
    },
    {
        "question": "编写Servlet类时需要继承哪个类？",
        "options": {
            "A": "jakarta.servlet.Filter",
            "B": "jakarta.servlet.http.HttpServlet",
            "C": "jakarta.servlet.ServletContext",
            "D": "jakarta.servlet.http.HttpSession"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 47
    },
    {
        "question": "Servlet的init()方法在何时被调用？",
        "options": {
            "A": "服务器启动时",
            "B": "第一次请求Servlet时",
            "C": "每次请求Servlet时",
            "D": "服务器关闭时"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 48
    },
    {
        "question": "JSP Model2架构对应MVC模式中的哪个角色由Servlet实现？",
        "options": {
            "A": "Model（模型）",
            "B": "View（视图）",
            "C": "Controller（控制器）",
            "D": "None of the above"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 49
    },
    {
        "question": "JSP Model1架构的核心组成部分是什么？",
        "options": {
            "A": "JSP + Servlet + JavaBean",
            "B": "JSP + JavaBean",
            "C": "Servlet + Filter + Listener",
            "D": "HTML + CSS + JavaScript"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 50
    },
    {
        "question": "下面是一个Servlet部署文件的片段:",
        "options": {
            "A": "FirstServlet",
            "B": "Hello",
            "C": "helpHello",
            "D": "/helpHello"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 51
    },
    {
        "question": "在JDBC中,使用PreparedStatement进行批量更新时,添加批量操作的方法是()",
        "options": {
            "A": "addBatch()",
            "B": "batchUpdate()",
            "C": "executeBatch()",
            "D": "setBatch()"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 52
    },
    {
        "question": "MySQL 8.0版本的JDBC驱动类名是()",
        "options": {
            "A": "com.mysql.cj.jdbc.Driver",
            "B": "com.mysql.jdbc.Driver",
            "C": "oracle.jdbc.driver.OracleDriver",
            "D": "org.postgresql.Driver"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 53
    },
    {
        "question": "在JSP页面中,使用EL表达式获取session作用域中名为'user'的对象的'username'属性,正确的写法是()",
        "options": {
            "A": "${sessionScope.user.username}",
            "B": "${requestScope.user.username}",
            "C": "${applicationScope.user.username}",
            "D": "${pageScope.user.username}"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 54
    },
    {
        "question": "EL表达式中表示逻辑与的运算符是()",
        "options": {
            "A": "&&",
            "B": "||",
            "C": "!",
            "D": "&"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 55
    },
    {
        "question": "使用EL表达式获取请求参数'username'的值,正确的写法是()",
        "options": {
            "A": "${param.username}",
            "B": "${request.getParameter('username')}",
            "C": "${params.username}",
            "D": "${requestScope.username}"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 56
    },
    {
        "question": "在HTML表单中实现文件上传,form标签的enctype属性应设置为()",
        "options": {
            "A": "multipart/form-data",
            "B": "application/x-www-form-urlencoded",
            "C": "text/plain",
            "D": "application/json"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 57
    },
    {
        "question": "在JSP页面中,使用JSTL的<c:if>标签判断EL表达式${user.age > 18}是否成立,正确的写法是()",
        "options": {
            "A": "<c:if test='${user.age > 18}'>成年</c:if>",
            "B": "<c:if condition='${user.age > 18}'>成年</c:if>",
            "C": "<c:if value='${user.age > 18}'>成年</c:if>",
            "D": "<c:if judge='${user.age > 18}'>成年</c:if>"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 58
    },
    {
        "question": "使用JDBC连接MySQL 8.0数据库,URL中需要指定的时区参数是()",
        "options": {
            "A": "serverTimezone",
            "B": "timezone",
            "C": "dbTimezone",
            "D": "zone"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 59
    },
    {
        "question": "使用JSTL的<c:forEach>标签遍历EL表达式${users}中的用户列表,并输出每个用户的姓名,正确的写法是()",
        "options": {
            "A": "<c:forEach items='{users}' var='u'>{u.name}</c:forEach>",
            "B": "<c:forEach collection='{users}' var='u'>{u.name}</c:forEach>",
            "C": "<c:forEach list='{users}' var='u'>{u.name}</c:forEach>",
            "D": "<c:forEach array='{users}' var='u'>{u.name}</c:forEach>"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 60
    },
    {
        "question": "在Apache Commons FileUpload中,判断FileItem是否为普通表单字段的方法是()",
        "options": {
            "A": "isFormField()",
            "B": "isFile()",
            "C": "isField()",
            "D": "isUploadFile()"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 61
    },
    {
        "question": "在Servlet中实现文件下载功能,需要设置响应头Content-Disposition的值为()",
        "options": {
            "A": "attachment;filename=文件名",
            "B": "inline;filename=文件名",
            "C": "download;filename=文件名",
            "D": "save;filename=文件名"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 62
    },
    {
        "question": "使用JSTL的<fmt:formatDate>标签格式化日期为'yyyy-MM-dd'格式,正确的pattern属性值是()",
        "options": {
            "A": "yyyy-MM-dd",
            "B": "YYYY-MM-DD",
            "C": "yyyy/MM/dd",
            "D": "yyyy年MM月dd日"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 63
    },
    {
        "question": "以下哪种JDBC对象可以有效防止SQL注入攻击()",
        "options": {
            "A": "PreparedStatement",
            "B": "Statement",
            "C": "CallableStatement",
            "D": "ResultSet"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 64
    },
    {
        "question": "MyBatis中用于执行SQL语句的核心接口是？",
        "options": {
            "A": "SqlSessionFactory",
            "B": "SqlSession",
            "C": "MapperProxy",
            "D": "Configuration"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 65
    },
    {
        "question": "在MyBatis的XML映射文件中，用于定义查询语句的标签是？",
        "options": {
            "A": "<insert>",
            "B": "<update>",
            "C": "<delete>",
            "D": "<select>"
        },
        "answer": [
            "D"
        ],
        "type": "single",
        "source": "",
        "id": 66
    },
    {
        "question": "在MyBatis中，用于传递多个参数的注解是？",
        "options": {
            "A": "@Param",
            "B": "@ParamMap",
            "C": "@Arguments",
            "D": "@Parameters"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 67
    },
    {
        "question": "MyBatis-Plus代码生成器的作用是？",
        "options": {
            "A": "自动生成数据库表",
            "B": "自动生成实体类、Mapper接口及XML文件",
            "C": "自动部署应用",
            "D": "自动测试代码"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 68
    },
    {
        "question": "以下哪个注解用于将Controller方法的返回值直接作为JSON格式响应体返回？（）",
        "options": {
            "A": "@RestController",
            "B": "@ResponseBody",
            "C": "@Controller",
            "D": "@ResponseStatus"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 69
    },
    {
        "question": "在Spring Boot中整合Spring MVC时，不需要额外配置以下哪项？",
        "options": {
            "A": "DispatcherServlet",
            "B": "视图解析器",
            "C": "静态资源映射",
            "D": "拦截器"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 70
    },
    {
        "question": "以下关于Spring MVC和Spring Boot关系的描述，正确的是（）",
        "options": {
            "A": "Spring Boot是Spring MVC的替代框架，二者不能同时使用",
            "B": "Spring Boot自动配置包含了Spring MVC的默认配置，可快速搭建Web应用",
            "C": "Spring MVC必须依赖Spring Boot才能运行",
            "D": "Spring Boot只能用于非Web项目开发，无法集成Spring MVC"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 71
    },
    {
        "question": "MyBatis-Plus中用于构造查询条件的类是？",
        "options": {
            "A": "QueryWrapper",
            "B": "SqlSession",
            "C": "MapperProxy",
            "D": "Configuration"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 72
    },
    {
        "question": "Spring MVC的前端控制器DispatcherServlet的作用是（）",
        "options": {
            "A": "处理所有客户端请求，负责请求分发和响应处理",
            "B": "仅处理POST请求，不处理GET请求",
            "C": "负责数据库连接和事务管理",
            "D": "仅用于静态资源的访问处理"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 73
    },
    {
        "question": "Spring Boot应用的启动类通常需要添加哪个注解？",
        "options": {
            "A": "@SpringBootApplication",
            "B": "@Configuration",
            "C": "@ComponentScan",
            "D": "@EnableAutoConfiguration"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 74
    },
    {
        "question": "在Spring MVC中，用于标识控制器类的注解是以下哪一个？",
        "options": {
            "A": "@Service",
            "B": "@Controller",
            "C": "@Repository",
            "D": "@Component"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 75
    },
    {
        "question": "在Spring MVC中，若要实现文件上传功能，需要配置以下哪个组件？（）",
        "options": {
            "A": "DispatcherServlet",
            "B": "MultipartResolver",
            "C": "ViewResolver",
            "D": "HandlerMapping"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 76
    },
    {
        "question": "Spring Boot Starter的作用是？",
        "options": {
            "A": "提供项目模板",
            "B": "简化依赖管理",
            "C": "自动生成代码",
            "D": "部署应用程序"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 77
    },
    {
        "question": "在Spring MVC中，用于映射HTTP GET请求的注解是？",
        "options": {
            "A": "@PostMapping",
            "B": "@GetMapping",
            "C": "@PutMapping",
            "D": "@DeleteMapping"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 78
    },
    {
        "question": "在Spring Boot中整合MyBatis时，需要添加的Starter依赖是？",
        "options": {
            "A": "spring-boot-starter-web",
            "B": "spring-boot-starter-jdbc",
            "C": "mybatis-spring-boot-starter",
            "D": "spring-boot-starter-test"
        },
        "answer": [
            "C"
        ],
        "type": "single",
        "source": "",
        "id": 79
    },
    {
        "question": "MyBatis-Plus的主要优势是？",
        "options": {
            "A": "需要手动编写所有SQL语句",
            "B": "提供CRUD操作的自动生成",
            "C": "仅支持XML配置",
            "D": "不兼容MyBatis"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 80
    },
    {
        "question": "以下关于Spring MVC视图解析器的描述，正确的是（）",
        "options": {
            "A": "视图解析器负责将Controller返回的逻辑视图名解析为物理视图地址",
            "B": "视图解析器仅支持JSP视图，不支持其他类型视图",
            "C": "视图解析器必须手动配置，Spring MVC无默认实现",
            "D": "视图解析器直接处理业务逻辑，不参与视图渲染"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 81
    },
    {
        "question": "在Spring MVC中，用于处理客户端请求并返回响应的核心组件是（）",
        "options": {
            "A": "Controller",
            "B": "Service",
            "C": "Repository",
            "D": "Configuration"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 82
    },
    {
        "question": "MyBatis中，Mapper接口的实现类是如何生成的？",
        "options": {
            "A": "手动编写",
            "B": "动态代理",
            "C": "XML配置生成",
            "D": "注解配置生成"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 83
    },
    {
        "question": "jsp:param动作标记不能单独使用，必须作为jsp:include、jsp:forward标记等的子标记使用，并为它们提供参数。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 84
    },
    {
        "question": "jsp:include动作标记与include指令标记包含文件的处理时间和方式不同。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 85
    },
    {
        "question": "不可以用一个page指令指定多个属性的取值。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 86
    },
    {
        "question": "程序中声明的变量不同于在“<%!”和“%>”中声明的页面成员变量，不能在不同客户访问页面的线程之间共享。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 87
    },
    {
        "question": "程序片变量的有效范围与其声明位置有关，即从声明位置向后有效，可以在声明位置后的程序片、表达式中使用。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 88
    },
    {
        "question": "JSP页面的成员方法不可以在JSP页面的Java程序片中调用。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 89
    },
    {
        "question": "在“<%”和“%>”标记之间声明的Java的变量在整个页面内有效，不同的客户之间不共享。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 90
    },
    {
        "question": "JSP页面中的变量和方法声明、表达式和Java程序片统称为JSP脚本元素。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 91
    },
    {
        "question": "Web应用程序是一种通过浏览器访问的B/S结构的应用程序。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 92
    },
    {
        "question": "JavaBean类中，如果有一个String类型的属性name，那么必须提供getName( )和setName( )两个方法。( )",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 93
    },
    {
        "question": "如果Bean中有一个boolean类型的属性married，则对应的getter方法名称必须是isMarried( )。( )",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 94
    },
    {
        "question": "在JSP中，可以不使用任何动作标记，直接通过new关键字创建JavaBean实例。( )",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 95
    },
    {
        "question": "JavaBean的类文件可以放在WEB-INF目录下的任何位置，不需要打包。( )",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 96
    },
    {
        "question": "Filter接口包含init、doFilter和destroy三个核心方法，其中doFilter方法每次请求时都会被调用。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 97
    },
    {
        "question": "JSP Model2对应MVC模式，其中Servlet担任控制器角色，JSP担任视图角色，JavaBean担任模型角色。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 98
    },
    {
        "question": "JSP Model2通过分离页面显示、流程控制和业务逻辑，解决了Model1在大型项目中的维护问题。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 99
    },
    {
        "question": "编写Servlet类时必须直接实现Servlet接口，不能继承HttpServlet类。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 100
    },
    {
        "question": "Servlet是Java编写的服务器端小程序，主要用于接收HTTP请求、处理业务逻辑并返回响应。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 101
    },
    {
        "question": "多个Filter的拦截顺序仅由web.xml中的配置顺序决定，与注解方式无关。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 102
    },
    {
        "question": "Servlet的service方法会根据请求类型（GET/POST）自动调用doGet或doPost方法。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 103
    },
    {
        "question": "创建Servlet类后无需部署即可直接运行，Web服务器会自动识别并调用。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 104
    },
    {
        "question": "Filter只能通过web.xml进行部署，不支持注解方式。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 105
    },
    {
        "question": "Filter的init方法在服务器启动时调用一次，destroy方法在服务器关闭时调用一次。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 106
    },
    {
        "question": "EL中只能使用\".\"操作符访问JavaBean的属性",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 107
    },
    {
        "question": "${null}在EL中会输出\"null\"字符串",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 108
    },
    {
        "question": "EL表达式的基本语法格式是${表达式}",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 109
    },
    {
        "question": "EL表达式${user.name}会自动调用user对象的getName()方法",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 110
    },
    {
        "question": "（ ）Tomcat 默认的端口号是 8080。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 111
    },
    {
        "question": "（ ）JSP 页面中的成员变量在每次用户访问时都会重新初始化。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 112
    },
    {
        "question": "（ ）JSP 表达式<%= %>的末尾需要加分号。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 113
    },
    {
        "question": "（ ）request.getParameter()方法用于获取多个同名的表单数据。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 114
    },
    {
        "question": "（ ）session对象在整个 Web 应用的所有用户之间共享数据。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 115
    },
    {
        "question": "（ ）application对象在服务器关闭时才被销毁。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 116
    },
    {
        "question": "（ ）<%@ include file=\"xxx.jsp\" %>是动态嵌入。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 117
    },
    {
        "question": "（ ）response.sendRedirect()是客户端重定向。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 118
    },
    {
        "question": "（）JSP 页面中可以不包含任何 HTML 标记。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 119
    },
    {
        "question": "（ ）<jsp:forward>动作标记会将控制权转回原页面。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 120
    },
    {
        "question": "JSTL标签库可以直接读取域对象中的数据。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 121
    },
    {
        "question": "文件上传表单必须设置enctype为multipart/form-data。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 122
    },
    {
        "question": "JDBC主要完成建立数据库连接、发送SQL命令、处理返回结果三件事。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 123
    },
    {
        "question": "page指令中isELIgnored属性的默认值为true。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 124
    },
    {
        "question": "Servlet 3.0版本开始提供内置的文件上传功能。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 125
    },
    {
        "question": "EL表达式的语法格式是<%= ... %>。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 126
    },
    {
        "question": "JSTL核心标签库可以实现if/for等流程控制语句。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 127
    },
    {
        "question": "EL表达式能够实现复杂的循环逻辑处理。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 128
    },
    {
        "question": "@Controller注解用于标识一个类为Spring MVC的控制器，处理用户请求。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 129
    },
    {
        "question": "Spring MVC的工作流程包括：请求→DispatcherServlet→HandlerMapping→Controller→ModelAndView→ViewResolver→视图渲染。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 130
    },
    {
        "question": "Spring MVC只能将请求参数绑定到基本数据类型，无法绑定到自定义实体类。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 131
    },
    {
        "question": "HandlerMapping组件的作用是根据URL找到对应的Controller处理方法。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 132
    },
    {
        "question": "在Model2模式中，每个用户管理功能（如添加、删除）都需要单独编写一个Servlet，导致类爆炸问题。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 133
    },
    {
        "question": "Spring MVC中，视图跳转仍需硬编码路径，与Model2模式相同。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 134
    },
    {
        "question": "Spring MVC的核心组件是DispatcherServlet，它作为前端控制器统一处理所有请求。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 135
    },
    {
        "question": "Spring MVC的工作流程中，请求首先到达Controller，再由Controller转发给DispatcherServlet。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 136
    },
    {
        "question": "InternalResourceViewResolver是Spring MVC中常用的视图解析器，用于解析JSP视图。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 137
    },
    {
        "question": "@RequestMapping注解只能用于类级别，不能用于方法级别。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 138
    },
    {
        "question": "Model2模式中，参数获取需要手动调用getParameter()方法，而Spring MVC可自动绑定参数到方法参数或实体对象。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 139
    },
    {
        "question": "Spring MVC直接提供数据库操作功能，无需整合其他持久层框架（如MyBatis）。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "B"
        ],
        "type": "single",
        "source": "",
        "id": 140
    },
    {
        "question": "ViewResolver组件的作用是根据逻辑视图名解析为具体的视图页面（如JSP）。",
        "options": {
            "A": "对",
            "B": "错"
        },
        "answer": [
            "A"
        ],
        "type": "single",
        "source": "",
        "id": 141
    },
    {
        "question": "使用<jsp:setProperty>标记时，如果将property属性设置为“____”，表示将表单中的所有参数自动匹配Bean的同名属性。",
        "options": null,
        "answer": [
            "*"
        ],
        "type": "fill",
        "source": "",
        "id": 142
    },
    {
        "question": "在JSP页面中，使用<jsp:useBean id=\"user\" class=\"com.bean.User\" scope=\"session\"/>后，可以通过<jsp:getProperty name=\"____\" property=\"username\"/>获取用户名。",
        "options": null,
        "answer": [
            "user"
        ],
        "type": "fill",
        "source": "",
        "id": 143
    },
    {
        "question": "<jsp:setProperty>标记中，用于指定Bean名称的属性是____，用于指定要设置的属性名的属性是____。",
        "options": null,
        "answer": [
            "name"
        ],
        "type": "fill",
        "source": "",
        "id": 144
    },
    {
        "question": "在JSP页面中，若要获取Bean的price属性，应使用<jsp:getProperty name=\"product\" property=\"____\" />。",
        "options": null,
        "answer": [
            "price"
        ],
        "type": "fill",
        "source": "",
        "id": 145
    },
    {
        "question": "在JSP页面中，使用JavaBean之前通常先用<jsp:useBean>动作标记创建或查找一个Bean，该动作标记的____属性用于指定Bean的唯一标识名。",
        "options": null,
        "answer": [
            "id"
        ],
        "type": "fill",
        "source": "",
        "id": 146
    },
    {
        "question": "在JSP中使用JavaBean时，<jsp:useBean>标记的scope属性默认值为____。",
        "options": null,
        "answer": [
            "page"
        ],
        "type": "fill",
        "source": "",
        "id": 147
    },
    {
        "question": "使用注解的过滤器，当拦截路径相同时，按过滤器类名的____1____顺序执行。",
        "options": null,
        "answer": [
            "字典"
        ],
        "type": "fill",
        "source": "",
        "id": 148
    },
    {
        "question": "编写过滤器类需要实现jakarta.servlet包中的____1____接口。",
        "options": null,
        "answer": [
            "Filter"
        ],
        "type": "fill",
        "source": "",
        "id": 149
    },
    {
        "question": "统计在线用户通常需要监听____1____对象的创建和销毁事件。",
        "options": null,
        "answer": [
            "HttpSession"
        ],
        "type": "fill",
        "source": "",
        "id": 150
    },
    {
        "question": "Filter接口的核心方法包括init()、destroy()和____1____方法。",
        "options": null,
        "answer": [
            "doFilter"
        ],
        "type": "fill",
        "source": "",
        "id": 151
    },
    {
        "question": "Servlet3.0开始支持使用____1____注解部署过滤器，无需web.xml配置。",
        "options": null,
        "answer": [
            "@WebFilter"
        ],
        "type": "fill",
        "source": "",
        "id": 152
    },
    {
        "question": "Filter接口的init()方法在____1____时调用一次。",
        "options": null,
        "answer": [
            "服务器启动"
        ],
        "type": "fill",
        "source": "",
        "id": 153
    },
    {
        "question": "Filter接口的doFilter()方法在____1____时调用。",
        "options": null,
        "answer": [
            "每次请求"
        ],
        "type": "fill",
        "source": "",
        "id": 154
    },
    {
        "question": "使用@WebFilter注解时，可通过____1____注解为过滤器添加初始化参数。",
        "options": null,
        "answer": [
            "@WebInitParam"
        ],
        "type": "fill",
        "source": "",
        "id": 155
    },
    {
        "question": "在doFilter()方法中，调用____1____方法会执行下一个过滤器或请求目标程序。",
        "options": null,
        "answer": [
            "chain.doFilter(req, resp)"
        ],
        "type": "fill",
        "source": "",
        "id": 156
    },
    {
        "question": "字符编码过滤器的核心功能是通过request对象调用____1____方法设置统一字符编码。",
        "options": null,
        "answer": [
            "setCharacterEncoding(String code)"
        ],
        "type": "fill",
        "source": "",
        "id": 157
    },
    {
        "question": "Spring MVC中，______注解用于标识一个类为控制器。",
        "options": null,
        "answer": [
            "@Controller"
        ],
        "type": "fill",
        "source": "",
        "id": 158
    },
    {
        "question": "MyBatis-Plus的通用CRUD接口中，______方法用于根据主键查询单条记录。",
        "options": null,
        "answer": [
            "getById"
        ],
        "type": "fill",
        "source": "",
        "id": 159
    },
    {
        "question": "Spring Boot默认加载classpath下的______或application.yml作为配置文件。",
        "options": null,
        "answer": [
            "application.properties"
        ],
        "type": "fill",
        "source": "",
        "id": 160
    },
    {
        "question": "MyBatis中，______标签用于实现循环遍历集合参数，常用于IN条件查询。",
        "options": null,
        "answer": [
            "<foreach>"
        ],
        "type": "fill",
        "source": "",
        "id": 161
    },
    {
        "question": "Spring Boot内置的默认Web服务器是______。",
        "options": null,
        "answer": [
            "Tomcat"
        ],
        "type": "fill",
        "source": "",
        "id": 162
    },
    {
        "question": "MyBatis核心工作流程包括读取配置、创建SqlSessionFactory、创建SqlSession、获取Mapper代理对象、执行SQL语句、结果集映射与处理以及______。",
        "options": null,
        "answer": [
            "关闭SqlSession资源"
        ],
        "type": "fill",
        "source": "",
        "id": 163
    },
    {
        "question": "Spring Boot应用的启动类需要添加______注解，以启用自动配置和组件扫描。",
        "options": null,
        "answer": [
            "@SpringBootApplication"
        ],
        "type": "fill",
        "source": "",
        "id": 164
    },
    {
        "question": "JSP 页面中声明成员变量和方法使用标记 ______。",
        "options": null,
        "answer": [
            "<%! %>"
        ],
        "type": "fill",
        "source": "",
        "id": 165
    },
    {
        "question": "获取表单中多个同名复选框的值，应使用 request.______() 方法。",
        "options": null,
        "answer": [
            "getParameterValues"
        ],
        "type": "fill",
        "source": "",
        "id": 166
    },
    {
        "question": "每个用户独立的会话对象是 ______。",
        "options": null,
        "answer": [
            "session"
        ],
        "type": "fill",
        "source": "",
        "id": 167
    },
    {
        "question": "pageContext 对象的生命周期是 ______ 域。",
        "options": null,
        "answer": [
            "page"
        ],
        "type": "fill",
        "source": "",
        "id": 168
    },
    {
        "question": "JSP Model2架构模型对应MVC设计模式，其中______充当控制器，负责接收请求并分发；______作为视图，负责页面显示；______作为模型，封装数据和业务逻辑。该模型采用______+______+JavaBean的技术组合。",
        "options": null,
        "answer": [
            "Servlet"
        ],
        "type": "fill",
        "source": "",
        "id": 169
    },
    {
        "question": "在JSP网页开发初级阶段，将Java代码嵌入网页处理业务逻辑会导致维护困难。JavaBean是遵循特定写法的Java类，用于封装业务逻辑，实现与HTML代码的分离，其核心特点包括：1) 必须具有______构造函数；2) 属性必须______；3) 通过______类型的方法暴露属性；4) 需要放在______内。",
        "options": null,
        "answer": [
            "无参的"
        ],
        "type": "fill",
        "source": "",
        "id": 170
    },
    {
        "question": "JSP Model1采用______+______的技术组合，将页面显示与业务逻辑分离。其中，______负责流程控制和页面显示，______封装数据和业务逻辑。但该模型在大型项目中存在______的问题。",
        "options": null,
        "answer": [
            "JSP"
        ],
        "type": "fill",
        "source": "",
        "id": 171
    },
    {
        "question": "过滤器位于______与______之间，可过滤请求和响应。编写过滤器需实现______接口，核心方法包括______（初始化）、______（执行过滤）和destroy()（销毁）。过滤器通过______对象将请求传递给下一个资源。",
        "options": null,
        "answer": [
            "浏览器"
        ],
        "type": "fill",
        "source": "",
        "id": 172
    },
    {
        "question": "JSP有9个内置对象，其中______对象用于输出内容到页面；______对象用于获取请求参数；______对象用于存储会话级数据；______对象代表整个Web应用的上下文；______对象用于处理异常信息。",
        "options": null,
        "answer": [
            "out"
        ],
        "type": "fill",
        "source": "",
        "id": 173
    },
    {
        "question": "Servlet是运行在服务器端的Java程序，用于处理______请求并生成响应。编写Servlet需继承______类，重写______和______方法处理GET和POST请求。Servlet的生命周期包括______、服务和销毁三个阶段。",
        "options": null,
        "answer": [
            "HTTP"
        ],
        "type": "fill",
        "source": "",
        "id": 174
    },
    {
        "question": "Session对象代表客户端与服务器的一次会话，其类型为______接口。Web服务器为每个Session分配唯一的______用于区分用户。Session对象通过______方法保存数据，通过______方法获取数据，会话结束的条件包括______或会话超时。",
        "options": null,
        "answer": [
            "jakarta.servlet.http.HttpSession"
        ],
        "type": "fill",
        "source": "",
        "id": 175
    },
    {
        "question": "EL提供了多个隐含对象，用于方便地访问不同范围的数据。例如，___________隐含对象用于访问pageContext范围的属性，___________用于访问request范围的属性，___________用于访问session范围的属性，___________用于访问application范围的属性。此外，___________隐含对象用于访问单个请求参数，___________用于访问多个请求参数的值。",
        "options": null,
        "answer": [
            "pageScope"
        ],
        "type": "fill",
        "source": "",
        "id": 176
    },
    {
        "question": "要在JSP页面中使用JSTL标签库，需要先在项目中引入JSTL的相关jar包（如___________和___________），然后在JSP页面的开头使用taglib指令引入相应的标签库。例如，引入核心标签库的taglib指令是___________",
        "options": null,
        "answer": [
            "jstl.jar"
        ],
        "type": "fill",
        "source": "",
        "id": 177
    },
    {
        "question": "JSTL的核心标签库主要用于流程控制，包括条件判断、循环和分支等。例如，___________标签用于条件判断，___________",
        "options": null,
        "answer": [
            "<c:if>"
        ],
        "type": "fill",
        "source": "",
        "id": 178
    },
    {
        "question": "EL表达式的基本语法格式是___________，它的作用类似于JSP中的___________语法，用于快速从域对象或请求参数中取值并输出，支持简单运算。例如，要输出名为user的JavaBean对象的username属性值，EL表达式可以写为___________。",
        "options": null,
        "answer": [
            "${表达式}"
        ],
        "type": "fill",
        "source": "",
        "id": 179
    }
]
  },
};

let currentSubject = 'marx';
let QUESTION_BANK = SUBJECTS[currentSubject].questions;